{"data":{"title":"Basic Gameplay","slug":"basic-gameplay","description":"Learn the fundamentals of playing DDR - how to read the screen and where to put your feet.","sections":["Positioning yourself","Bar or no bar?","Reading the screen","Basic techniques","Correcting mistakes","Further reading"]},"content":"For every piece of trivia that I consider to be \"common knowledge\", thousands to tens of thousands of people will learn about it for the first time each and every day. It's just how [the numbers|https://xkcd.com/1053/] work out. And while DanceDanceRevolution gameplay is perhaps *slightly* more niche than your average piece of common knowledge, it's still undeniably part of the Internet's collective consciousness. It's embedded in GIFs and [viral YouTube videos|https://www.youtube.com/watch?v=MFlCD_IaTE8] and the odd [movie|https://www.youtube.com/watch?v=qatmvE7S4Sw] or two. Regardless of how much you already know about DDR, this article aims to get you up to speed: where to put your feet, how to read the screen, and some basic techniques that you can try out at the arcade.\r\n\r\n## Positioning yourself\r\n\r\nLet's say you're about to start your first song - if you need help reaching this point, check out our article on [navigating the DDR UI]. First, make sure you're standing on the correct side of the [glossary:dance stage]; if you started the game using the buttons on the left, then stand on the left set of four panels. You should see the four [glossary:receptors] on the corresponding side of the screen.\r\n\r\nWhere should you put your feet? Intuition might tell you to place them in the center, on the metal panel between the four arrows. Most players would recommend that you **put your feet on the left and right arrows** instead - your feet will never need to move onto that center panel anyway! You don't need to plant your feet dead-center on the arrow panels; each [glossary:panel] has four sensors, one on each edge, meaning that you're free to hit the panels on any side. This is one of the most basic principles of *energy conservation* - a crucial concept once you start playing the harder [glossary:difficulties|difficulty]. It takes less energy to keep your feet relatively close to the middle than it does to move them all the way to each panel's center.\r\n\r\n### Bar or no bar?\r\n\r\nNow that you know where to put your legs, it's time to talk about your arms. Behind the [glossary:dance stage], each set of four panels has its own metal bar, roughly at waist level (depending on your height). **Hold onto the bar during gameplay**; this will make it easier to maintain your center of gravity as you move around. Every player holds the bar slightly differently, so don't worry too much about holding it the \"right\" way - just find a position that's comfortable on your hands and arms.\r\n\r\nYou may have heard of players who play \"no bar\", or even been told that playing without the bar is the \"correct\" way to play. In modern times, the vast majority of the DDR community has put this debate to rest: **there's no shame in holding the bar**, and players who insist otherwise are woefully stuck in the past. That said, if no-bar play sounds appealing to you, try it out! Some players stick with it for life; others practice it occasionally for fun, or for building endurance. But for absolute newcomers, playing without the bar will greatly steepen the learning curve, whereas playing with the bar eliminates the center-of-gravity variable from the equation. The choice should be obvious.\r\n\r\n## Reading the screen\r\n\r\nYour arms and legs are in position, and now it's time to actually play the game. Before the arrows show up on-screen, take a moment to internalize the rhythm of the [glossary:song]; most songs in DDR play a few seconds of audio before the first note. Maybe tap your foot to the beat, or just watch the flashes of the [glossary:receptors] at the top of the screen; on the lower difficulties, most notes will coincide exactly with these beats.\r\n\r\nNow, when a scrolling arrow overlaps completely with its receptor, step on the corresponding panel. Repeat this process until the song is over. You're done!\r\n\r\nWell, mostly. You still have to decide *which foot* to use to hit each note. The most basic rule is to use your left foot to hit left arrows, your right foot to hit right arrows, and whichever foot is more convenient at the moment for up and down arrows. This rule ensures that you'll always be able to face the screen without having to turn your body significantly. A slightly more robust rule is to **alternate using your left and right feet** for each note. [glossary:Charts|chart] aren't random, and most of the time, they're written to cater to this very common play style. Alternating left and right steps balances your exertion across the two halves of your body, minimizes the amount of movement required, and just *feels* natural. (Of course, if you have to hit two of the *same* arrow in a row - say, two consecutive left arrows - then go ahead and use the same foot twice.)\r\n\r\nThat said, DDR would be a pretty boring game if this were the end of the story, so let's talk about some slightly more advanced techniques.\r\n\r\n## Basic techniques\r\n\r\nWhen two scrolling arrows appear on the same row, it's called a [glossary:jump]. You want to step *onto* both panels on the beat, not *jump off of* them - this is a common mistake among casual arcade-goers. You don't need to jump particularly high; putting too much energy into it will wear you out way quicker than everything else. You do need to hit both panels reasonably close in time to each other, so trying to hit the two arrows in rapid succession probably won't work.\r\n\r\nSome arrows have a long vertical \"tail\" after them; these are [glossary:freeze notes|freeze note]. Hit the arrow normally, then keep your foot on that panel at least until the end of the tail has passed. You don't need to lift your foot off of the panel when the freeze note ends. The game will give you some leniency if you briefly release the freeze note, say, to reposition your foot, but only for a fraction of a second, so don't rely on that leniency too much.\r\n\r\nWhile you're holding a freeze note, there might be other arrows you have to hit. You'll need to use your other foot to hit these, regardless of which panel they're on; this is a case where the \"alternating feet\" rule no longer applies. If you're worried about losing your balance during these patterns, remember to hold onto the bar to keep your center of gravity steady.\r\n\r\nSpeaking of \"alternating feet\", you will eventually encounter patterns where strictly alternating your feet would force you to hit the right arrow with your left foot, or the left arrow with your right foot. What should you do in this case? You have two options: you could [glossary:double-step], breaking the rule in order to hit the left/right arrow with the closer foot. Alternatively, you could keep alternating your feet regardless, which is known as a [glossary:crossover]. Crossovers are very common in DDR, and it's generally recommended to **learn how to crossover** sooner rather than later. It might feel a little unnatural at first, but it's one of the gameplay mechanics that makes DDR so *interesting* to play and watch. Give them a try!\r\n\r\n## Correcting mistakes\r\n\r\nThere's no doubt that you'll make mistakes your first time on the dance stage. Resolving these mistakes is usually just a matter of **practice**; don't try to memorize step sequences for specific songs! Most mistakes fall into one of three categories: *spatial accuracy* (hitting the correct arrow panel), *temporal accuracy* (hitting notes on the right beat), and *temporal precision* (hitting notes **on** the beat, colloquially known as \"timing\").\r\n\r\nIf you find yourself hitting the wrong panel by mistake (spatial accuracy), there's not much to do other than to practice. Reading the notes on-screen is like reading a new language; you shouldn't need to look down at the panels any more than you need to refer to the alphabet to read English text. For isolated notes, it doesn't take too long to develop the mental associations required to correlate an up arrow to a forward movement of your leg. Reading denser sequences of notes will take longer, as you need to develop muscle memory that translates whole sequences of arrows into leg movements. This is the main barrier of entry to the higher difficulties of DDR (and any rhythm game, really); all you can do is **practice**.\r\n\r\nIf you're incurring [glossary:misses|miss] despite hitting the correct panel (temporal accuracy), you might need to work on internalizing the rhythm of the song, as discussed before. Remember that you should hit the arrows when they *completely overlap* with the corresponding receptor, not when the tip of the arrow touches the bottom of the receptor. If you're trying to push into harder levels, keep in mind that you'll start seeing notes that fall *between* the [glossary:beats|beat]. You can distinguish these notes more easily by changing your arrow color to NOTE from the [glossary:Option] menu; red arrows correspond to quarter notes, while blue notes are halfway between (8th notes). You can read more about note [glossary:quantization] in the glossary.\r\n\r\nIf you're hitting the notes with low judgements like [glossary:Good] and [glossary:Great] (temporal precision), then you probably understand when you're supposed to hit the notes, but have trouble translating that information to precise muscle movements. Like everything in DDR, this is a skill best developed by copious amounts of **practice**. One thing you can do to accelerate your process is enable Slow/Late indicators from the [glossary:e-amusement] website; doing this will add an indicator near the judgements when you're stepping too soon or too late. However, this requires that you have not only an e-amusement account, but a [glossary:PASELI] subscription, costing about $3/month. If you're dedicated to improving your scores, you can follow [bemanistyle's guide on PASELI and the Basic Course subscription|https://www.bemanistyle.com/e-amusement-how-to-charging-paseli-and-basic-course-subscription/] that enables Slow/Late indicators.\r\n\r\nDid I mention that **practice** is the best way to improve and resolve mistakes? If there's one thing you take away from this article, it should be that practice makes perfect - or rather, [glossary:Marvelous]!\r\n\r\n## Further reading\r\n\r\nAs mentioned before, we have an article on [navigating the DDR UI] if you've never touched DanceDanceRevolution A/A20 before.\r\n\r\nYou should also read about [setting your speed], which will become important to improving your game much quicker than you might imagine."}