{"data":{"title":"Home Setup & Resources","slug":"home-setup-and-resources","description":"The resources and tools you need to practice and learn at home.","sections":["StepMania","Adding DDR songs to StepMania","Online references"],"date":"April 6, 2020","author":{"name":"J.T. Vandenbree","url":"https://twitter.com/TizaTryhards"}},"content":"\r\nTry as we might, we can’t stay at the arcade all the time. For those of you who can’t get enough DDR, there are ways you can keep having fun when you can’t be on the pads. In this article, we’ll discuss several resources you can use to play, practice, and study at home.\r\n\r\n> #### In a nutshell\r\n\r\n> StepMania is a free, open-source rhythm game simulator that will let you play official and custom DDR songs on your keyboard or a home pad.  You can download StepMania versions of official DDR songs from Zenius-I-Vanisher (click here for songs from A20)\r\n> Yuisin’s Youtube channel has reference videos of hundreds of DDR charts. Remywiki is a collaborative resource for all kinds of information about [glossary:Bemani] games. True BPM lists and visualizes exact BPM data for every song in DDR.\r\n> DDRCommunity contains community-created difficulty rankings, event listings, and descriptions of official Konami events.\r\n\r\n## StepMania\r\n\r\nStepMania is a free, open-source simulator for DDR and other rhythm games that you can download here. We’re going to cover the basics of setting up StepMania here, but the program has a ton of functionality for you to explore!\r\n\r\nInstall StepMania like any other program on your computer, and it’s ready to go immediately! It comes with a few demo simfiles - StepMania song files - for testing. You’ll learn how to get more in the Zenius-I-Vanisher section below). StepMania also allows for you to completely customize the appearance and functionality of the game and menu using themes. One theme in particular is very common among western players - Simply Love. Simply Love adds a ton of new options, functions, and interface settings that will take your setup to the next level. Download the theme and drop the folder into your `StepMania\\Themes` folder. Select the theme in the options menu under Display Options → Appearance Options → Theme.\r\n\r\n![Set Theme (step 1)|/images/Article - home-setup-and-resources - Set Theme - 1.jpg]\r\n\r\n![Set Theme (step 2)|/images/Article - home-setup-and-resources - Set Theme - 2.jpg]\r\n\r\n![Set Theme (step 3)|/images/Article - home-setup-and-resources - Set Theme - 3.jpg]\r\n\r\n![Set Theme (step 4)|/images/Article - home-setup-and-resources - Set Theme - 4.jpg]\r\n\r\nHow you configure StepMania is up to you, but we recommend setting the Default Fail Type to ImmediateContinue in the Advanced Options section.  This keeps the song playing when you [glossary:fail], instead of ending the song the moment you fail.\r\n\r\n![Set Default Fail Type (step 1)|/images/Article - home-setup-and-resources - Set Default Fail Type - 1.jpg]\r\n\r\n![Set Default Fail Type (step 2)|/images/Article - home-setup-and-resources - Set Default Fail Type - 2.jpg]\r\n\r\n![Set Default Fail Type (step 3)|/images/Article - home-setup-and-resources - Set Default Fail Type - 3.jpg]\r\n\r\nA few useful features:\r\n\r\n* Music Rate lets you play a song faster or slower than its actual speed. Useful for slowing down tough sections to get a feel for them. Find it in the Song Options menu by hitting enter a second time after picking a song.\r\n\r\n![Set Music Rate|/images/Article - home-setup-and-resources - Music Rate.jpg]\r\n\r\n* Assist Tick makes a clapping sound on every arrow, helping you hear the rhythms as they’re meant to be played. This can be turned on from the song options menu or by pressing F7 during gameplay.\r\n* Edit Mode, selectable from the main menu, can be used to practice individual sections of songs. After picking a song, use the spacebar to highlight an area, then press P to play. In conjunction with assist tick and a slower music rate, it’s the best way to learn tricky sections that give you trouble. You can set your options from the menu that appears after pressing Escape.\r\n\r\n![Edit Mode (step 1)|/images/Article - home-setup-and-resources - Edit Mode - 1.jpg]\r\n\r\n![Edit Mode (step 2)|/images/Article - home-setup-and-resources - Edit Mode - 2.jpg]\r\n\r\n![Edit Mode (step 3)|/images/Article - home-setup-and-resources - Edit Mode - 3.jpg]\r\n\r\n## Adding DDR songs to StepMania\r\n\r\nOnce you’ve gotten StepMania installed, it’s time to load it up with songs. [Zenius-I-vanisher|https://zenius-i-vanisher.com/] (ZIv) is a rhythm game community site, sporting news, forums, and simfiles. You can find plenty of user-made custom songs here, but most useful is their expansive directory of official DDR arcade simfiles. Click through the dropdown menus to download individual songs or full packs from mixes. DDR A20 simfiles are viewable here, with regular updates as more songs are released.\r\n\r\nDownloading these packs will let you try songs at home before playing them at the arcade, helping you plan your sets better, and spend more time playing!\r\n\r\n## Online references\r\n\r\nWith so much content in modern DDR, the community has created plenty of places for you to look up information about the game. Here are some of the most valuable resources out there.\r\n\r\n* [yuisin’s YouTube channel|https://www.youtube.com/channel/UCyrf1KnurHCOaz69FVoZXfA] has hundreds of videos of DDR charts with assist tick turned on. Great for studying at home or on the go.\r\n* [RemyWiki|https://remywiki.com/] is a wiki-style resource for all kinds of information about DDR and all Bemani games. Learn how to unlock songs, look up your favorite artists, or see detailed step counts and BPMs.\r\n* [true BPM|http://truebpm.dance/] visualizes [glossary:BPM changes|BPM change] over time for every DDR song, and even recommends speed mods given a preferred reading speed.\r\n* [DDRCommunity|http://ddrcommunity.com/] is a news and event site, helpful for following live and upcoming tournaments or keeping up with the latest official news from [glossary:Konami] in English.\r\n"}