{"data":{"title":"Setting your Speed Option","slug":"setting-your-speed","description":"Finding the right multiplier for the song, plus some gotchas to look out for.","sections":["Understanding speed","Finding your target BPM","Speed in practice","Dealing with strange BPMs"],"date":"December 2, 2019","author":{"name":"DDRGuide.com Staff"}},"content":"Of all the settings you can change from the Option menu, speed is the most important *and* the most heavily dependent on the song. Most players will set or verify their speed choice before every stage, as the penalty for leaving it on the wrong choice can range from getting a lower [glossary:score] to outright [glossary:failing|fail] the song. In this article we'll discuss how the speed mod affects gameplay, how to choose your speed for each song, and some important caveats for specific songs.\r\n\r\n> #### In A Nutshell\r\n> On DanceDanceRevolution A / A20, press the \"9\" key on the music selection screen to access the Option menu. Set your speed *lower* for songs with a *greater* maximum BPM and vice-versa. The BPM times your speed multiplier should be somewhere between 250 and 600, wherever you feel comfortable.\r\n\r\n## Understanding speed\r\n\r\nIf you're not familiar with the concept, *speed* in rhythm games determines the rate at which the [glossary:notes|note] scroll vertically across the screen. Speed doesn't affect the density of notes over time - that is, you won't have to *move* faster to hit the notes - the effect it has is purely visual. Higher speed means that the notes will scroll faster and be more spaced apart, which aids readability, especially in densely packed charts. However, higher speed also means that you have less time to react to the notes, since they take less time to scroll from the edge of the screen to the [glossary:receptors]. Finding the right speed is all about finding a balance between its positives and negatives - ideally, you should give yourself just enough time to comfortably react to the notes.\r\n\r\nIn DanceDanceRevolution, your choice of speed acts as a multiplier for the song's base speed, which is determined by its tempo. In practice, this means that songs with a higher tempo (i.e. a greater BPM) naturally scroll faster than songs with a lower tempo. For this reason, faster songs in DDR require a lower speed multiplier than slower songs in order to read the notes comfortably.\r\n\r\n> #### Trivia\r\n> Many rhythm games have since eliminated the concept of a \"base speed\", so that the speed multiplier doesn't have to be changed for each song. DanceDanceRevolution, being one of the first ever vertically-scrolling rhythm game series (having debuted in 1998), offers its players no such respite.\r\n\r\n## Finding your target BPM\r\n\r\nThe formula for scroll speed is relatively simple: take the BPM of the song and multiply it by your speed option. For example, a 140 BPM song being played on x2.0 speed has an *effective speed* of 280. If you're brand-new to DDR, your first task should be to determine what effective speed works best for you. Start out slow - no higher than x2.0 for your first few songs - and raise your speed by small increments until you're comfortable reading and executing the charts. You should be able to distinguish rhythms and consecutive notes easily, but shouldn't feel rushed to hit each note. Feel free to reduce your speed if you need more time to react.\r\n\r\nMost new players can read effective speeds of 250-300 with no trouble. As you push into more difficult charts, you may find that this is too slow to distinguish densely-packed clusters of notes. Try raising your speed when this happens! High-level players tend to read [glossary:Expert] / [glossary:Challenge] charts at speeds closer to 600.\r\n\r\n## Speed in practice\r\n\r\nLet's say you're at the arcade, in the middle of a DDR session, and you've found a song you want to play. You've already figured out your preferred target BPM - let's say it's **400**, for example. Here's what to do:\r\n\r\n* Check the song's BPM. This is in a fixed place near the top-center of the screen, next to the song's artwork and below the title and artist. Let's say the BPM is **180** in this example.\r\n* Either do some mental math or pull out your phone's calculator to divide your target BPM by the song's BPM - for example, **400** divided by **180**. \r\n* Round up or down to the nearest available speed option, since the result will probably be a fraction that you can't choose directly. In our example, 400/180 is about 2.22, which makes **x2.25** a solid choice (or perhaps **x2.0** if you want to aim slower).\r\n\r\nThen, enter the option menu by pressing \"9\" on the cabinet's number pad and use the left/right buttons to adjust your speed. You can dismiss the option menu by pressing \"9\" again, or by holding the green or down button until the last option has been passed. Alternatively, you can enter the option menu by holding the green button, but keep in mind that doing this also selects the song, with no way to back out! If you want more information on how to navigate the DanceDanceRevolution UI, [we have an article for that|navigating-the-ddr-ui].\r\n\r\nThis covers the majority of songs in DDR - those that have just one BPM. However, things aren't always so simple in DDR...\r\n\r\n## Dealing with strange BPMs\r\n\r\nSome songs incorporate [glossary:BPM changes|BPM change], timed events in the song where the scrolling rate increases or decreases. Since there's no option to \"flatten\" these speed changes, DDR players must compromise in order to read the chart comfortably.\r\n\r\n> #### Trivia\r\n> Some rhythm games do have an option to \"flatten\" these speed changes. This is known in StepMania and In The Groove as *C-Mod*, meaning a *constant* speed modifier. Whether it's acceptable or not depends entirely on the context; for casual play it's generally not frowned upon, but it may be prohibited in some tournaments, possibly on specific songs.\r\n\r\nSongs with BPM changes will display a BPM range on the music selection screen - typically the slowest and fastest BPMs in the chart. The first rule-of-thumb is to **set your speed modifier for the faster BPM**, as this ensures you will always have enough time to react to the notes. With this strategy, you opt to compromise on readability during the slower sections. The alternative (setting speed according to the slower BPM) would instead compromise on reaction time during the faster sections, which is strongly discouraged unless you know what you're doing.\r\n\r\nThere are some outliers to these rules, especially with boss songs. Here are a few examples:\r\n\r\n* [song:Go For The Top] displays a BPM of 74-180, but there is actually a brief 400+ BPM section in the middle. This section technically contains no notes, but it *ends* with a note that you will have far less time to react to than the rest of the chart.\r\n* Many songs with \"EVOLVED\" in the title have an incorrect BPM displayed; some claim to have a constant BPM despite featuring speed changes,  while others show a BPM range that doesn't match the chart.\r\n* Some songs may display a glitchy animated sequence of random numbers in the BPM field, particularly those in the [glossary:Extra Exclusive] folder. This has no bearing on the nature of the song's tempo; it's just hidden from public view.\r\n\r\nIf you're ever uncertain, refer to **[truebpm.dance|https://truebpm.dance]** for detailed information on the song's actual speed. This is a great resource to keep bookmarked on your phone for reference purposes!\r\n\r\n## Further reading\r\n\r\nTo learn more about the options you can set in DDR, check the glossary entry for the [glossary:option menu|option], as well as the [glossary:speed] entry.\r\n\r\nFor another strategy players use to deal with BPM changes, check out the [glossary:SUDDEN+] option."}