[{"term":"Cabinet","aka":["Game cabinet","Cab"],"concept":"Hardware","definition":"The physical unit that houses the game display, navigation buttons, [e-amusement] scanner, and the computer running the game. The cabinet connects to a [dance stage] to register player inputs."},{"term":"White cabinet","concept":"Hardware","definition":"The model of [DDR] cabinets released alongside [DDR A], mostly seen in North America. These cabinets can be found at various Round1 and Dave & Buster's locations in the United States. Many of these cabinets have been upgraded to [DDR A20] as of October 2019 at both major chains, although some are still running [DDR A]."},{"term":"Gold cabinet","concept":"Hardware","definition":"The model of [DDR] cabinets released alongside [DDR A20]. These cabinets can be found at all Round1 locations in the United States. In addition to the new cabinet & [dance stage] design, gold cabinets offer some exclusive A20 features like [Dan] courses and exclusive new songs."},{"term":"Dance stage","aka":["Stage","Dance pad","Pads"],"concept":"Hardware","definition":"The physical box that houses the [panels|panel] and connects to the main [game cabinet|cabinet]. Players typically stand on this stage during gameplay."},{"term":"Panel","concept":"Hardware","definition":"One of the primary gameplay inputs, typically activated by a player stepping onto it. There are four panels per side, for a total of eight panels on a standard [dance stage]."},{"term":"Receptors","concept":"Gameplay elements","definition":"The visual element typically seen at the top of the screen used by players to determine when to hit each [note]. Each [panel] being used in the current gameplay mode has a corresponding arrow-shaped receptor towards which notes will scroll. The receptors flash in sync with the music on each quarter note.\n\nPlayers can hide the receptors by setting the \"Step zone\" [option] to \"HIDDEN\", or place the receptors at the bottom of the screen by setting the \"Scroll\" option to \"REVERSE\".\n"},{"term":"Note","concept":"Gameplay elements","definition":"The main scoring element during gameplay, represented visually by an arrow scrolling towards the [receptors]. Players try to step on the corresponding [panel] as close as possible to the moment when the arrow coincides with its receptor; the game assigns them a [judgement] based on how precisely they timed their step."},{"term":"Jump","concept":"Gameplay elements","definition":"Two different [notes|note] on the same horizontal row, typically hit by jumping with both feet onto the corresponding [panels|panel]."},{"term":"Freeze note","concept":"Gameplay elements","aka":["Freeze","Hold note","Hold"],"definition":"A special [note] where the player must keep the corresponding [panel] pressed until the \"tail\" of the freeze note has passed.","trivia":"Freeze notes were introduced in DDRMAX -DanceDance Revolution 6thMIX-."},{"term":"Shock arrow","concept":"Gameplay elements","aka":["Shock notes","Shocks"],"definition":"A special gameplay element represented visually by four lightning-strung arrows in a row scrolling towards the [receptors]. Players must avoid standing on the corresponding [panels] when it passes in order to avoid triggering the shock arrow, which causes a [miss] and briefly obscures the scrolling notes.","trivia":"Shock arrows were introduced in DanceDanceRevolution X."},{"term":"SP","acronym":"Single Play","aka":["Singles"],"concept":"Modes & Stages","definition":"Gameplay mode where one player plays on one side of the [dance stage] (four [panels]). Also refers to the [charts|chart] accessible through this mode and [Versus Play]."},{"term":"DP","acronym":"Double Play","aka":["Doubles"],"concept":"Modes & Stages","definition":"Gameplay mode where one player plays on both sides of the [dance stage] (eight [panels]). Also refers to the [charts|chart] accessible through this mode."},{"term":"Versus Play","concept":"Modes & Stages","definition":"Gameplay mode where two players play on one side of the [dance stage] each (four [panels] each). Both players must share [song] picks for each [stage], but can select different [single|SP] charts and [options|option] for themselves."},{"term":"Session","aka":["Set"],"concept":"Modes & Stages","definition":"The unit of gameplay associated with a player's entire arcade visit, typically comprising multiple [games|game], with optional breaks between games."},{"term":"Game","concept":"Modes & Stages","definition":"The unit of gameplay purchased with each card swipe at an arcade. Players typically start each game by swiping their [e-amusement] pass and choosing their gameplay mode, then play 3-4 [stages|stage] (depending on the [cabinet]'s configuration and whether they meet the requirements for an [Extra Stage]).\n\nOf course, the word \"game\" can also refer to the [DDR] videogame itself, and other videogames. Context is key.\n"},{"term":"Stage","aka":["Round"],"concept":"Modes & Stages","definition":"The unit of gameplay associated with a player's choice of [song] and [chart]. Most [cabinets|cabinet] are configured for 3 stages per [game], with the possibility of gaining an [Extra Stage] after the normal stages. Some songs can only be played during the [Final Stage], and others yet are gated behind the Extra Stage.\n\n[Premium Play] guarantees that all 3 stages will be played, regardless of whether the player [fails|fail] or not. Without Premium Play, failing a stage ends the game immediately.\n"},{"term":"Final Stage","concept":"Modes & Stages","definition":"The last of the normal [stages|stage], typically the third stage. Some event [songs|song] may be exclusive to this stage. In order to access the [Extra Stage], the Final Stage *must* be [cleared|clear], in addition meeting the [result star] requirements."},{"term":"Extra Stage","concept":"Modes & Stages","definition":"A bonus [stage] that can be gained at the end of a [game] using [Premium Play]. Extra Stage can be used to unlock [Extra Savior] songs and play [Extra Exclusive] songs, but it forces the [LIFE4] gauge and ends the stage immediately if all players [fail].\n\nIn order to access this stage, the [Final Stage] must be cleared with the [result star] gauge filled. On [DDR A] only, result stars are also automatically added to a player's account after each game when they have reached certain [Heat Power] levels.\n\nDuring rare events, it's possible to obtain yet *another* stage after this one: the [Encore Extra Stage].\n\nFull details on the Extra Stage requirements and exclusive songs can be found on RemyWiki's [DDR A|https://remywiki.com/AC_DDR_A#EXTRA_STAGE] and [DDR A20|https://remywiki.com/AC_DDR_A20#EXTRA_STAGE] pages.\n"},{"term":"Extra Exclusive","concept":"Modes & Stages","definition":"A special [song] folder that can only be accessed in the [Extra Stage], containing songs that are temporarily exclusive to the Extra Stage."},{"term":"Extra Savior","concept":"Modes & Stages","definition":"An unlock mechanic consisting of a variety of special [song] folders that can only be accessed in the [Extra Stage]. The exact unlock mechanics vary from event to event, but in general, clearing an Extra Savior [chart] will unlock it for play during normal [stages|stage], and unlocking all charts for a song will remove it from the Extra Savior folder (as it can be found in the corresponding DDR mix [folder|sorting]).\n\nFull details on the unlock requirements for Extra Savior songs can be found on RemyWiki's [DDR A|https://remywiki.com/AC_DDR_A#Unlockable_Songs] and [DDR A20|https://remywiki.com/AC_DDR_A20#Unlockable_Songs] pages.\n"},{"term":"Result Star","concept":"Modes & Stages","definition":"The gameplay mechanic which enables access to the [Extra Stage] when using [Premium Play]. After each [stage], up to three result stars are awarded per player. If all nine slots are filled after [clearing|clear] the [Final Stage], the [Extra Stage] will commence and the result star gauge will reset to empty on the next [game]. The result star gauge is shared when two players are present, and carries over for subsequent games when not completely filled.\n\nClearing a stage with a [grade] of AAA awards 3 stars. Otherwise, clearing with a grade of AA- or higher awards 2 stars, and clearing with a grade of A+ or lower awards 1 star. Additionally, obtaining a [full combo] or playing on the [LIFE4] or [RISKY] gauge both award a bonus star, up to the maximum of 3.\n"},{"term":"Heat Power","concept":"Modes & Stages","definition":"A [DDR A] exclusive mechanic that primarily affects the [Extra Stage]. Heat Power is represented by a 7-bar gauge that starts empty on each day (divided by [e-amusement] maintenance periods) and increases by one after every [game] a player completes on [Premium Play]. At 3 bars, the player enters Heat Power level 2, and at a full 7 bars the player enters Heat Power level 3.\n\nSome [Extra Exclusive] songs can only be played at a particular Heat Power level. Additionally, higher Heat Power levels provide the player with bonus [result stars|result star] that make it easier to obtain the [Extra Stage] (level 2 gives 3 stars and level 3 gives 9 stars).\n"},{"term":"Encore Extra Stage","aka":["Encore Stage","One More Extra Stage","OMES"],"concept":"Modes & Stages","definition":"A special [stage] following the [Encore Stage] that can only be accessed during certain events. This stage does not allow the player to control the [song], [chart], or [options|option], and the stage ends immediately if the player receives a [judgement] of [Great], [Good], or [Miss]. Currently, there is no way to access the Encore Extra Stage as there is no active event that makes use of it.","trivia":"The last time Encore Extra Stage was accessible ranged from July 12, 2017 to April 26, 2018, during the \"Rinon's Adventure\" event finale for [DDR A]. Clearing the [Extra Exclusive] song ENDYMION on [Expert] with a [grade] of AA+ or higher would trigger the Encore Extra Stage with the song ACE FOR ACES on [Difficult]. The [difficulty] requirements were gradually relaxed over the following months until ACE FOR ACES was ultimately made available outside of the Encore Extra Stage."},{"term":"Song","concept":"Charts","definition":"You know, like, music. Every song has a jacket (square artwork) and a number of [charts|chart] associated with it - no more than one per [difficulty] per gameplay mode ([SP] or [DP]).\n\n\"Song\" is often informally used as a synonym for [stage].\n"},{"term":"Chart","aka":["Pattern"],"concept":"Charts","definition":"A gameplay sequence for a particular song. Each chart has a [difficulty], [level], and [groove radar] displayed on the song selection screen. During gameplay, the chart lays out where notes (and other gameplay elements like [shock arrows] and [speed changes|speed change]) are placed."},{"term":"Speed change","aka":["Speed gimmick","Gimmick","Timing change","Timing gimmick"],"concept":"Gameplay elements","definition":"Speed changes include [BPM changes|BPM change] and [stops|stop]. These are typically shared across all [charts|chart] for a [song], although on rare occasions specific charts may have separate speed changes from the other charts. There is no visual indication that a speed change is about to occur, so players may wish to memorize the locations of speed changes for some songs.","trivia":"The only songs that have different speed changes for different charts are ACE FOR ACES ([Beginner]/[Basic] have no speed changes, all other difficulties have their own distinct speed changes) and CHAOS Terror-Tech Mix (only [Challenge] has separate speed changes)."},{"term":"BPM change","concept":"Gameplay elements","definition":"A [speed change] where the scroll speed increases or decreases. These typically occur in powers of two, i.e. doubling or halving the scroll speed, and are typically placed to follow the subjective \"intensity\" of the song.\n\nBPM changes can also be used in very small increments to correct the timing on \"drifty\" songs.\n"},{"term":"Stop","aka":["Stutter gimmick","Stutter"],"concept":"Gameplay elements","definition":"A [speed change] where the scroll speed comes to a complete halt. These are typically placed to accent moments in the [song] where the music goes quiet, or on particular percussive hits.\n\nRapid-fire stops can create what players call a \"stutter gimmick\", where the scroll speed is effectively reduced in a choppy motion without any [BPM change].\n"},{"term":"Judgement","concept":"Scores","definition":"An indicator of how precisely the player hit a [note], with respect to timing. Every judgement has an associated timing window that determines how early or late a note may be hit, compared to the exact timing of the note. Judgements with smaller timing windows take precedence over those with larger timing windows. After each [stage], the players can review how many times they received each judgement on the results screen. The judgements are [Marvelous], [Perfect], [Great], [Good], [OK], and [Miss]."},{"term":"Marvelous","aka":["Marvs (slang)"],"concept":"Scores","definition":"The best [note judgement|judgement], above [Perfect]. The timing window for the Marvelous judgement is 16.666… ms.","trivia":"The Marvelous judgement was introduced in DanceDanceRevolution EXTREME, but only in courses. It was introduced to normal gameplay in DDR SuperNOVA2. Prior to its introduction, Perfect was the best note judgement - hence the peculiar naming convention.\n\nThe [score] gained from each Marvelous is determined by dividing the maximum score of 1,000,000 by the maximum number of Marvelous and [OK] judgements that can be obtained in the current chart. If the maximum score described above isn't a multiple of 10 on the current [stage] (which it usually won't be), the score will actually fluctuate on a note-by-note basis between the surrounding multiples of 10, such that the total adds up to exactly 1,000,000.\n"},{"term":"Perfect","aka":["Perfs (slang)"],"concept":"Scores","definition":"The second-best [note judgement|judgement], below [Marvelous] and above [Great]. The timing window for the Perfect judgement is 33.333… ms.","trivia":"The [score] obtained from each Perfect is the corresponding Marvelous score minus 10."},{"term":"Great","concept":"Scores","definition":"The third-best [note judgement|judgement], below [Perfect] and above [Good]. The timing window for the Great judgement is about 92 ms TODO CONFIRM.","trivia":"The [score] obtained from each Great is the corresponding Perfect score times 60%, rounded down to a multiple of 10."},{"term":"Good","concept":"Scores","definition":"The fourth-best [note judgement|judgement], below [Great]. The timing window for the Good judgement is about 142 ms TODO CONFIRM.","trivia":"The [score] obtained from each Good is the corresponding Perfect score times 20%, rounded down to a multiple of 10."},{"term":"OK","concept":"Scores","definition":"A pseudo-[judgement] obtained by holding a [freeze note] to its end or avoiding a [shock arrow].","trivia":"The [score] gained from each OK is the same as [Marvelous]."},{"term":"Miss","concept":"Scores","definition":"Failing to hit an arrow within the widest timing window (namely [Good]) incurs a Miss, as does dropping a [freeze note] or triggering a [shock arrow]. Obtaining a miss will reset the player's [combo] back to zero and decrease the [life gauge] (unless it is already empty). Misses do not increase or decrease the player's [score]."},{"term":"Pad miss","aka":["Pad s**t (slang)"],"concept":"Scores","definition":"Informal term for a [miss] judgement that the player believes the game registered erroneously. The [panels|panel], like any piece of hardware, are not perfect and can malfunction or require different pressure compared to other panels, especially if poorly maintained."},{"term":"MA","acronym":"Marvelous Attack","concept":"Scores","definition":"A player or score's proportion of [Marvelous] judgements compared to all other judgements, typically quantified in vague terms rather than a specific ratio (e.g. \"really good MA\").","trivia":"In the rhythm game series *In The Groove*, the equivalent term is \"FA\" for \"Fantastic Attack\"."},{"term":"Combo","concept":"Combos & Lamps","definition":"An indicator of how many notes the player has hit consecutively without obtaining any [misses|miss]. [Jumps|jump] and avoided [shock arrows|shock arrow] both increment the combo by one; holding [freeze notes|freeze note] to the end does not increment the combo.\n\nMaintaining a combo until the end of the song is known as a \"Full Combo\" or [FC], although this is usually further qualified with the lowest judgement obtained: [GFC], [PFC], or [MFC].\n"},{"term":"MFC","acronym":"Marvelous Full Combo","aka":["Marvelous Sweep","Miff (slang)"],"concept":"Combos & Lamps","definition":"A score obtained by getting a [Marvelous] judgement on every step, with no [Misses|Miss].\n\nThis is the highest score in the game, corresponding to a [money score|score] of 1,000,000.\n\nThe [sort folder|Sorting] for MFCs is labeled \"MARVELOUS SWEEP\".\n","trivia":"All [Single|SP] charts [rated|level] 14 and lower have been MFC'd by at least one player. Only one MFC on an 18 has ever been recorded: [CHRS4LFE's MFC|https://www.youtube.com/watch?v=gKXz57J1eK4] of [song:Fascination ~eternal love mix~].\n"},{"term":"PFC","acronym":"Perfect Full Combo","aka":["Piff (slang)"],"concept":"Combos & Lamps","definition":"A score obtained by getting either a [Marvelous] or [Perfect] judgement on every step, with no [Misses|Miss].\n\nThe [score] for a PFC will be 1,000,000 minus the number of Perfect judgements obtained times 10.\n","trivia":"All [Single|SP] charts [rated|level] 18 and lower have been PFC'd by at least one player. Only one PFC on a 19 has ever been recorded: [CHRS4LFE's PFC|https://www.youtube.com/watch?v=QWCXAdaj2Vs] of [song:EGOISM 440] [CSP] on December 13, 2017.\n\nAll [Double|DP] charts rated 16 and lower have been PFC'd by at least one player. All but one DP 17 have been PFC'd; the one remaining is [song:Dopamine] [EDP]. Some DP 18s have been PFC'd.  No DP 19 has ever been PFC'd.\n"},{"term":"GFC","acronym":"Great Full Combo","concept":"Combos & Lamps","definition":"A score obtained by getting either a [Marvelous], [Perfect], or [Great] judgement on every step, with no [Misses|Miss].\n\nThe [score] for any GFC will typically be lower than any PFC on the same chart, due to Greats costing significantly more points off of the maximum than Perfects, although this is not always the case.\n","trivia":"All [Single|SP] charts [rated|level] 18 and lower have been not only GFC'd, but [PFC]'d by at least one player.  Some SP 19s have been GFC'd.\n\nAll [Double|DP] charts rated 17 and lower have been GFC'd by at least one player. Many DP 18s have been GFC'd as well.\n"},{"term":"FC","acronym":"Full Combo","aka":["Good Full Combo","Blue Full Combo","BFC"],"concept":"Combos & Lamps","definition":"A score obtained by [clearing|clear] a [stage] with no [Misses|Miss]. [Good] judgements do not break combo in [DDR A], so a FC is distinct from (and more permissive than) a [GFC].","trivia":"All but one [Single|SP] chart have been FC'd by at least one player; the one remaining is [song:ENDYMION] [CSP].\n\nAll [Double|DP] charts rated 17 and lower have been not only FC'd, but [GFC]'d by at least one player. Most DP 18s have been FC'd as well. No DP 19s have been FC'd by anyone.\n"},{"term":"Flag","aka":["Black flag"],"concept":"Combos & Lamps","definition":"Informal term which typically denotes a score that misses a [PFC] by one [Great]. Sometimes also used to describe an [MFC] missed by one [Perfect].\n\nA \"true black flag\" indicates that the lone [Great] or [Perfect] judgement was obtained on the last [note] of the [chart].\n"},{"term":"SDP","acronym":"Single-Digit Perfects","concept":"Combos & Lamps","definition":"A [PFC] with the added constraint of fewer than 10 [Perfect] judgements.\n\nThe score for a SDP will be between 999,910 (9 Perfects) and 999,990 (1 Perfect, a type of [flag]).\n"},{"term":"SDG","acronym":"Single-Digit Greats","concept":"Combos & Lamps","definition":"A [GFC] with the added constraint of fewer than 10 [Great] judgements."},{"term":"Life gauge","concept":"Gameplay elements","definition":"An indicator of the player's performance, displayed above the [receptors]. The normal life gauge is a continuous meter that starts out half-full, rises slowly as combo increases, and depletes quickly when the player incurs a [miss]. The normal gauge can be replaced with the [LIFE4] or [RISKY] gauge in the player's modifiers before each song. Depleting the life gauge completely results in a [failing|fail] grade, and the player's [score] is frozen."},{"term":"Clear","aka":["Pass"],"concept":"Scores","definition":"Completing a [stage] without [failing|fail] due to the [life gauge] depleting. Clears are assigned a [letter grade|grade] from D to AAA and are eligible for various [lamps|lamp] contingent on modifiers and full [combo]-based clear levels."},{"term":"Assist clear","concept":"Scores","definition":"Completing a [stage] without [failing|fail], but with the use of an [option] that removes notes or other scoring elements from gameplay. Using any of the non-default choices under the \"Cut\", \"Freeze Arrow\", or \"Jumps\" options will count as an assist clear for the purpose of [lamps|lamp]."},{"term":"Fail","aka":["Game over"],"concept":"Scores","definition":"Ending a [stage] with a depleted [life gauge]. Fails are assigned a [letter grade|grade] of E, although the score the player obtained prior to the life gauge depleting is equally valid as a score obtained by [clearing|clear] the stage."},{"term":"Score","aka":["Money score"],"concept":"Scores","definition":"A numeric indicator of a player's accuracy & timing precision on a given [stage], ranging from 0 to 1,000,000. The score is a cumulative measure of the scores corresponding to the [judgements|judgement] they received on each [note] (and [freeze note] and [shock arrow]). Sometimes called \"money score\" to differentiate from [EX score].\n\n\"Score\" can also refer to the more general results of a [stage], without strictly meaning the numeric score.\n"},{"term":"EX score","aka":["EX points","EX"],"concept":"Scores","definition":"An alternative scoring method where judgements are assigned the following weights:\n\n* [Marvelous] & [OK]: 3\n* [Perfect]: 2\n* [Great]: 1\n* [Good] & [Miss]: 0\n\nEX score is displayed on the results screen below the [judgement] counts. In [Event Mode], the normal score and EX score displays may be swapped.\n","trivia":"This scoring method is favored in tournaments over [money score|score] because it assigns comparable weights to Perfects and Greats, unlike the standard scoring system where, for example, nearly any reasonable [PFC] would beat a near-[MFC] missed by only one great."},{"term":"Grade","aka":["Letter grade","Rank"],"concept":"Scores","definition":"A letter-based rank assigned to a player's performance on a [stage], based on their [score] and whether they [cleared|clear] or [failed|fail] the stage. Here are the grades and their conditions:\n\n* AAA: Clear with a score of 990,000 or higher.\n* AA+: Clear with a score between 950,000 (inclusive) and 990,000 (exclusive).\n* AA: Clear with a score between 900,000 (inclusive) and 950,000 (exclusive).\n* AA-: Clear with a score between 890,000 (inclusive) and 900,000 (exclusive).\n* A+: Clear with a score between 850,000 (inclusive) and 890,000 (exclusive).\n* A: Clear with a score between 800,000 (inclusive) and 850,000 (exclusive).\n* A-: Clear with a score between 790,000 (inclusive) and 800,000 (exclusive).\n* B+: Clear with a score between 750,000 (inclusive) and 790,000 (exclusive).\n* B: Clear with a score between 700,000 (inclusive) and 750,000 (exclusive).\n* B-: Clear with a score between 690,000 (inclusive) and 700,000 (exclusive).\n* C+: Clear with a score between 650,000 (inclusive) and 690,000 (exclusive).\n* C: Clear with a score between 600,000 (inclusive) and 650,000 (exclusive).\n* C-: Clear with a score between 590,000 (inclusive) and 600,000 (exclusive).\n* D+: Clear with a score between 550,000 (inclusive) and 590,000 (exclusive).\n* D: Clear with a score below 550,000.\n* E: Fail with any score.\n","trivia":"Prior to DanceDanceRevolution SuperNOVA2, \"AAA\" was synonymous with [PFC], as the [Marvelous] judgement had not been introduced yet. The ensuing change in semantics was met with… mixed responses from the DDR community at the time."},{"term":"Sightread","concept":"Scores","definition":"Informal term for a score obtained on a player's first time seeing the chart, with no prior attempts and no knowledge of the chart beforehand.\n\nIf the player has *seen* the chart but hasn't *attempted* it yet, their first score would be better described by \"first try\" or \"first attempt\".\n"},{"term":"Lamp","aka":["Song lamp","Folder lamp"],"concept":"Combos & Lamps","definition":"A visual indicator of the highest clear level a player has obtained on a [song] or [folder|sorting]. On the song selection screen, lamps appear as two colored bars on the sides of each song jacket or folder entry. In [Versus Mode], each bar corresponds to each player; otherwise, both bars correspond to the single player.\n\n*Song lamps* are independent of the player's high score; obtaining a higher score with a lower clear level does not decrease the lamp's clear level. *Folder lamps* correspond to the lowest clear level in the folder; for example, to obtain a [FC] folder lamp, every song in the folder must have a FC or higher clear level.\n\nHere is the ordering and lamp color of the different clear levels:\n\n* [MFC] (flashing white)\n* [PFC] (flashing gold)\n* [GFC] (flashing green)\n* [FC] (flashing blue)\n* [LIFE4 clear|LIFE4] (red / white)\n* [normal clear|clear] (yellow)\n* [assist clear] (purple)\n* [failed|fail] (dark amber)\n* not played (black)\n","trivia":"On [SP|Single Play], the highest level folder on which any player has obtained an [MFC] lamp is 14 (by CHRS4LFE). For [PFC] lamps, the highest is 18, obtained by multiple players. Currently, no player has documented a clear level higher than the normal clear lamp on the SP 19 folder (although BROSONI. had a FC lamp prior to ENDYMION [CSP]'s release)."},{"term":"Difficulty","concept":"Charts","definition":"One of five slots for [charts|chart] in ascending order of, well, difficulty. These include [Beginner] ([SP] only), [Basic], [Difficult], [Expert], and [Challenge] (only on some songs).","trivia":"Some older songs have [Challenge] charts that are actually easier than the [Expert] chart, as this slot was originally used for more \"experimental\" gameplay techniques, rather than simply harder techniques."},{"term":"Level","concept":"Charts","aka":["Rating","Meter"],"definition":"A number assigned to each [chart] denoting how hard it is to [clear] relative to all other charts in the game. Currently, levels range from 1 to 19.","trivia":"Prior to DanceDanceRevolution X, levels ranged from 1 to 10. During this time, 10s corresponded to charts as easy as modern-day 13s and as hard as modern-day 18s - perhaps you can see why the scale was expanded."},{"term":"Beginner","concept":"Charts","definition":"The easiest [difficulty] in the game on [SP], below [Basic]. Beginner charts typically range in [level] from 1 to 5, but can go as high as 9 on some boss songs."},{"term":"Basic","concept":"Charts","definition":"The [difficulty] above [Beginner] ([SP] only) and below [Difficult]. On [DP], this is the easiest difficulty. Basic charts typically range in [level] TODO"},{"term":"Difficult","concept":"Charts","definition":"The [difficulty] above [Basic] and below [Expert]. Difficult charts typically range in [level] TODO"},{"term":"Expert","concept":"Charts","definition":"The [difficulty] above [Difficult] and below [Challenge], when present. Expert charts typically range in [level] from 9 to 17, but can go as low as 5 TODO CONFIRM on some older songs and as high as 18 on some boss songs."},{"term":"Challenge","aka":["Oni (outdated)"],"concept":"Charts","definition":"The [difficulty] above [Expert]. Only some [songs|song] have a Challenge [chart]; those that do will have one on both [SP] and [DP]. Challenge charts typically range in [level] from 10 to 18, but can go as low as 8 TODO CONFIRM on some older songs and as high as 19 on some boss songs.","trivia":"A small number of songs *only* have Challenge charts available; players must use an [e-amusement] pass to access these songs, in order to prevent casual players from accidentally selecting them."},{"term":"BSP","acronym":"Basic Single Pattern","concept":"Charts","definition":"*BSP* refers to [Basic] [Single|SP] [Pattern|Chart]; a double chart in the Basic difficulty slot.\n\n*bSP* (with a lowercase \"b\") refers to [Beginner] [Single|SP] [Pattern|Chart].\n"},{"term":"BDP","acronym":"Basic Double Pattern","concept":"Charts","definition":"A [double|DP] [chart] in the [Basic] difficulty slot."},{"term":"DSP","acronym":"Difficult Single Pattern","concept":"Charts","definition":"A [single|SP] [chart] in the [Difficult] difficulty slot."},{"term":"DDP","acronym":"Difficult Double Pattern","concept":"Charts","definition":"A [double|DP] [chart] in the [Difficult] difficulty slot."},{"term":"ESP","acronym":"Expert Single Pattern","concept":"Charts","definition":"A [single|SP] [chart] in the [Expert] difficulty slot."},{"term":"EDP","acronym":"Expert Double Pattern","concept":"Charts","definition":"A [double|DP] [chart] in the [Expert] difficulty slot."},{"term":"CSP","acronym":"Challenge Single Pattern","concept":"Charts","definition":"A [single|SP] [chart] in the [Challenge] difficulty slot."},{"term":"CDP","acronym":"Challenge Double Pattern","concept":"Charts","definition":"A [double|DP] [chart] in the [Challenge] difficulty slot."},{"term":"Option","aka":["Modifier","Mod"],"concept":"Options","definition":"A configurable aspect of gameplay. The option menu is accessible by pressing \"9\" on the [cabinet]'s number pad, or by holding the green button when selecting a [song] or [chart]. Here are the options available:\n\n* **Speed**: Multiplies the speed at which the [notes|note] scroll. See [Speed] for additional details.\n* **Boost**: When enabled, the scroll speed changes as notes move across the screen. Choices are:\n    - NORMAL (default)\n    - BOOST (notes accelerate as they approach the [receptors])\n    - BRAKE (notes *decelerate* as they approach the [receptors])\n    - WAVE (notes alternate accelerating and decelerating as they scroll)\n* **Appearance**: When enabled, the notes are covered from one side of the screen. Choices are:\n    - VISIBLE (default)\n    - HIDDEN+ (notes are covered as they approach the receptors)\n    - [SUDDEN+] (notes are covered *away from* the receptors)\n    - HIDDEN+&SUDDEN+ (both lane covers are in effect)\n    - STEALTH (notes are invisible)\n        - During gameplay, HIDDEN+ and SUDDEN+ can be toggled by pressing the green button and adjusted vertically using the Up/Down buttons.\n* **Turn**: When enabled, the chart is transformed such that the notes are rotated or mirrored around the pad. (The receptors do not change order or position; the chart can still be read normally, but the notes to hit will be in different lanes.) Choices are:\n    - NORMAL (default)\n    - LEFT (chart is rotated counterclockwise)\n    - RIGHT (chart is rotated clockwise)\n    - MIRROR (chart is mirrored across the receptors - or, equivalently, rotated 180°)\n    - SHUFFLE (arrow lanes are shuffled according to a randomly chosen permutation, out of 8 possible permutations)\n        - LEFT, RIGHT, and SHUFFLE are not available on [double play|DP].\n* **Step zone**: Toggles visibility of the [receptors|receptor]. Choices are \"ON\" (default) and \"OFF\" (receptors are invisible).\n* **Scroll**: Toggles which direction the notes scroll. Choices are:\n    - NORMAL (notes scroll up to the receptors at the top)\n    - REVERSE (notes scroll *down* to the receptors at the bottom)\n* **Arrow color**: Changes the color of the notes. This is a distinct option from [arrow type], which can only be configured from the [e-amusement] website. Choices are:\n    - RAINBOW (notes have animated colors according to their [quantization])\n    - NOTE (notes have solid colors according to their quantization)\n    - VIVID (notes are random rainbow colors)\n    - FLAT (notes are all the same rainbow color)\n* **Cut**: An [assist|assist clear] option that removes notes from the chart based on their [quantization]. Choices are:\n    - OFF (default)\n    - ON1 (only quarter notes are kept; all other notes are removed)\n    - ON2 (only quarter and eighth notes are kept; all other notes are removed)\n* **Freeze arrow**: An [assist|assist clear] option that removes [freeze notes|freeze note] from the chart. Choices are \"ON\" (default) and \"OFF\" (freeze notes are removed).\n* **Jumps**: An [assist|assist clear] option that removes [jumps|jump] from the chart. Choices are \"ON\" (default) and \"OFF\" (jumps are removed).\n* **Gauge**: Determines the [life gauge] to use. Choices are:\n    - NORMAL (default)\n    - [LIFE4] (four [misses|miss] fails the stage)\n    - [RISKY] (one [miss] fails the stage and ends gameplay immediately)\n\nOptions persist for each player between [stages|stage], and across subsequent [games|game] and other [cabinets|cabinet].\n\nWhen a cabinet is offline, only Speed, Scroll, Cut, Freeze arrow, and Jumps are available; all other options are locked to their default choices.\n\n> #### Tip\n> The most important option is the first one, [Speed], which most players change for every stage.\n> You may also want to set your Arrow Color to NOTE to more easily read the [quantization] of notes.\n"},{"term":"Speed","aka":["Rate","X-mod"],"concept":"Options","definition":"How fast the [notes] and other gameplay elements scroll across the screen. As an [option], the player's choice of speed multiplies the baseline \"x1.0\" speed, where consecutive [quarter note|quantization] arrows are directly adjacent to one another (no overlap and no space between the arrows). Lower numbers correspond to slower scrolling; for example, selecting x0.5 will cause consecutive [quarter notes|quantization] to overlap halfway, whereas selecting 2x will space consecutive quarter notes apart by an arrow's worth of space.\n\nSpeed can be adjusted from the Options menu before each [stage]. In [Premium Play], the options are x0.25-x4.0 in increments of 0.25, then x4.5-x8.0 in increments of 0.5. Without Premium Play, the options are limited to x1.0-x8.0 in increments of 0.5.\n\nThe speed can also be adjusted during gameplay, prior to the first [note] of the chart, by pressing the Left or Right buttons on the [cabinet] to decrease or increase the speed, respectively. The only exception is during the [Encore Extra Stage], during which this method of changing the speed is disabled.\n","trivia":"RemyWiki [documents|https://remywiki.com/DDR_AC_General_Info#SPEED] which DDR mix each speed option was introduced in."},{"term":"SUDDEN+","concept":"Options","definition":"A choice under the \"Appearance\" [option] that players use to assist in reading [charts|chart] with [BPM changes|BPM change]. Specifically, by turning SUDDEN+ on during the slow sections (and off otherwise), some players find it easier to concentrate on the reduced number of notes visible.\n\nDuring gameplay, SUDDEN+ can be toggled by pressing the green button and adjusted vertically using the Up/Down buttons. This requires careful planning because using the [cabinet] buttons during gameplay typically requires stepping off of the [dance stage] briefly. As such, the technique is only helpful if there is a gap in the notes long enough for the player to toggle SUDDEN+ when necessary.\n"},{"term":"LIFE4","aka":["Hard clear"],"concept":"Options","definition":"A [life gauge] mode where the player starts the [stage] with 4 \"lives\" that can be lost by [missing|miss] notes. The gauge display above the [receptors] is replaced with four discrete cells indicating how many lives remain. Lives cannot be regained during the song. Losing all four lives has the same effect as depleting the normal life gauge.\n\nDuring [Extra Stage], the life gauge is forced onto LIFE4 mode, and losing all four lives will additionally obscure the notefield for that player (either with a \"Game Over\" display if another player is still playing, or by transitioning to the \"Failed\" screen immediately otherwise).\n","trivia":"All [SP] charts have been LIFE4 cleared by at least one player.\n\nAll [DP] charts [rated|level] 17 and below have been not only LIFE4 cleared, but [GFC]'d by at least one player. Almost all DP 18s have been LIFE4 cleared as well; notably, [song:Pluto Relinquish] [CDP] has not been LIFE4 cleared yet. At least one DP 19 has been LIFE4 cleared - [song:POSSESSION] CDP, by FEFEMZ.\n\n\"LIFE4\" also refers to the community-led [LIFE4 ranking system|https://life4ddr.com/].\n"},{"term":"RISKY","concept":"Options","definition":"A [life gauge] mode where the player starts the [stage] with 1 \"life\" that can be lost by obtaining a [Miss] judgement. The gauge display appears the same as the [LIFE4] gauge, except the first three cells are already empty when the song starts. The song immediately ends if all players [fail] on the RISKY life gauge.\n\nBy definition, clearing a song using the RISKY life gauge is at minimum a [FC], so there is no separate [clear level|lamp] for RISKY clears.\n"},{"term":"Guide lines","concept":"Options","definition":"Horizontal lines that optionally appear behind the [notes|note] during gameplay. Choices include \"OFF\" (no lines), \"BORDER\" (lines separate beats), and \"CENTER\" (default; lines denote beats). The brighter lines indicate [measures|measure].\n\nGuide lines can be toggled from the [e-amusement] website; once logged in, click [this link|https://p.eagate.573.jp/game/ddr/ddra20/p/setting/op_detail_setting.html?opt=15] to set your choice, then press the *first* of the two buttons at the bottom to save.\n"},{"term":"Arrow type","aka":["Noteskin","Normal","X","Classic","Cyber","Medium","Small","Dot"],"concept":"Options","definition":"The visual appearance of the [notes|note] during gameplay. Choices include \"Normal\" (default), \"X\", \"Classic\", \"Cyber\", \"Medium\", \"Small\", and \"Dot\".\n\nArrow type can be changed through the [e-amusement] website; once logged in, click [this link|https://p.eagate.573.jp/game/ddr/ddra20/p/setting/op_detail_setting.html?opt=14] to set your arrow type, then press the *first* of the two buttons at the bottom to save.\n"},{"term":"Screen filter","aka":["Dark","Darker","Darkest"],"concept":"Options","definition":"A filter behind the [notes|note] during gameplay that darkens the background for easier reading of notes. Choices include \"Off\", \"Dark\" (default), \"Darker\", and \"Darkest\".\n\nScreen filter can be changed through the [e-amusement] website; once logged in, click [this link|https://p.eagate.573.jp/game/ddr/ddra20/p/setting/op_detail_setting.html?opt=16] to set your screen filter, then press the *first* of the two buttons at the bottom to save.\n"},{"term":"Judgement display priority","concept":"Options","definition":"An option exclusive to [Basic Course] subscribers that changes whether the judgement and combo indicators appear in front of or behind the [notes|note] during gameplay. By default, the judgement and combo indicators appear in front of the notes.\n\nJudgement display priority can be changed through the [e-amusement] website; once logged in, click [this link|https://p.eagate.573.jp/game/ddr/ddra20/p/setting/op_detail_setting.html?opt=1] to set your choice, then press the *first* of the two buttons at the bottom to save.\n"},{"term":"Timing judgement display","aka":["Fast/Slow","Slow/Fast"],"concept":"Options","definition":"An option exclusive to [Basic Course] subscribers that adds an indicator above the combo for whether a note hit with a non-[Marvelous] judgement was pressed too fast (early) or too slow (late) relative to the Marvelous timing window. By default, the timing judgement display is disabled.\n\nTiming judgement display can be changed through the [e-amusement] website; once logged in, click [this link|https://p.eagate.573.jp/game/ddr/ddra20/p/setting/op_detail_setting.html?opt=2] to set your choice, then press the *first* of the two buttons at the bottom to save.\n"},{"term":"Quantization","aka":["Division","Note color"],"concept":"Rhythm","definition":"In dance games, the quantization of a [note] is a measure of how finely a [measure] of the song must be divided in order for the note's timing to coincide with one of these subdivisions. DDR and many other other dance games assign each note's color according to its quantization. Here are the relevant subdivisions and their colors when using the \"NOTE\" Arrow Color [option]:\n\n* 4th (quarter) notes: Red\n* 8th notes: Blue\n* 16th notes: Yellow\n* 32nd notes: Orange\n* 64th notes and triplets (12th, 24th, 48th…): Green\n"},{"term":"Measure","concept":"Rhythm","definition":"Four [beats|beat] of a [song].\n\nWhen [guide lines] are enabled, measures are denoted by the brigher scrolling lines.\n"},{"term":"Beat","concept":"Rhythm","definition":"The most commonly understood subdivision of a [song] according to its tempo, which is accordingly measured in beats per minute (BPM). One beat is equivalent to a [quarter note|quantization].\n\nWhen [guide lines] are enabled, each line denotes one beat of the song.\n"},{"term":"Konami","concept":"Bemani","definition":"The Japanese entertainment company behind [DDR] and other [Bemani] games. Konami is best known in North America for console & PC videogames like Metal Gear and Silent Hill."},{"term":"Bemani","concept":"Bemani","definition":"[Konami]'s rhythm game division, which includes [DanceDanceRevolution|DDR], DANCERUSH STARDOM, beatmania IIDX, SOUND VOLTEX, jubeat, pop'n music, GITADORA, NOSTALGIA, and other inactive titles.\n"},{"term":"DDR","acronym":"DanceDanceRevolution","aka":["Dance Dance Revolution"],"concept":"Bemani","definition":"The game series that this website is all about! To play DDR, step on the [dance stage]'s [panels|panel] whenever a [note] scrolls onto the corresponding [receptor] on the screen.\n\nThe latest version (or [mix]) of DDR is [DanceDanceRevolution A20].\n"},{"term":"Mix","aka":["Version"],"concept":"Bemani","definition":"Individual installments of DDR are called \"mixes\"; there have been 17 arcade DDR mixes to date, along with a variety of home console releases. The two latest mixes (and the primary focus of this website) are [DDR A] and [DDR A20].\n"},{"term":"DDR A","acronym":"DanceDanceRevolution A","aka":["Ace"],"concept":"Bemani","definition":"The 2016 installment of [DDR], pronounced \"Ace\". This [mix] is noteworthy for being the first mix to bring [online functionality|e-amusement] (e.g. leaderboards and score tracking) to North America. Most arcades have since upgraded their DDR A cabinet software to run [DDR A20].\n"},{"term":"DDR A20","acronym":"DanceDanceRevolution A20","aka":["A20"],"concept":"Bemani","definition":"The latest installment of [DDR], announced in 2018 to celebrate the game series' 20th anniversary, then released in 2019. \"A20\" is officially pronounced \"Ace two-oh\", but often read literally as \"A-twenty\".\n\nThere are two versions of A20 available, depending on the cabinet model. [Gold cabinets|gold cabinet] feature A20 with a gold color theme, whereas [white cabinets|white cabinet] have a slightly different version of A20 with a blue color theme reminiscent of [DDR A].\n"},{"term":"Dave & Buster's","aka":["D&B"],"concept":"Bemani","definition":"An American restaurant & entertainment chain that provides many arcade games, including the [white cabinet] model of [DDR] at select locations.\n"},{"term":"ROUND1","aka":["R1","Round One"],"concept":"Bemani","definition":"A Japanese amusement chain that provides many arcade games, including a wide variety of [Bemani] games like [DDR]. Most of its US locations have the new [gold cabinet|gold cabinets] model of DDR, in addition to one or two [white cabinets|white cabinet] running either [DDR A] or [A20|DDR A20].\n"},{"term":"e-amusement","aka":["eAmuse","EA"],"concept":"Online features","definition":"An online service provided by [Konami] that enhances DDR gameplay in a variety of ways. Players swipe an e-amusement pass near the [cabinet]'s card reader to authenticate at the start of each [game].\n\nThe e-amusement website is [p.eagate.573.jp|https://p.eagate.573.jp/]. From here you can register an account, link an e-amusement card, and set various options for DDR gameplay like [guide lines], [arrow type], [screen filter] and more.\n\nFor more information on registering an e-amusement card, refer to the bemanistyle article [How to: Japanese KONAMI ID registration & e-amusement pass management|https://www.bemanistyle.com/how-to-register-for-a-japanese-konami-id-and-manage-your-eamusement-pass/]. Heed the note about leaving your region set to Japan if you intend to purchase the [Basic Course].\n"},{"term":"Premium Play","concept":"Online features","definition":"A gameplay mode for online [cabinets|cabinet] that enables many game mechanics, including the [Extra Stage], more granular [speed] choices, and guaranteed play of 3 songs regardless of whether the first two [stages|stage] are [cleared|clear].\n\nOn North American cabinets, Premium Play is available for no additional cost; in Japan, it typically costs [PASELI] or additional game credits.\n"},{"term":"Basic Course","concept":"Online features","definition":"An [e-amusement] subscription feature that enables DDR players to view their scores through the e-amusement website, change additional options like [judgement display priority] and [timing judgement display], and more. This feature is paid for using [PASELI].\n\nFor more information on purchasing the Basic Course and PASELI, refer to the bemanistyle guide [e-amusement How to: Charging PASELI and Basic Course Subscription|https://www.bemanistyle.com/e-amusement-how-to-charging-paseli-and-basic-course-subscription/]. Note that purchasing BitCash is no longer required for players in North America, as the [e-amusement] website now accepts non-Japanese credit cards for payment.\n"},{"term":"PASELI","concept":"Online features","definition":"[Konami]'s in-house currency for arcade games, used to pay for the [Basic Course] for an enhanced DDR experience.\n\nFor more information on purchasing the Basic Course and PASELI, refer to the bemanistyle guide [e-amusement How to: Charging PASELI and Basic Course Subscription|https://www.bemanistyle.com/e-amusement-how-to-charging-paseli-and-basic-course-subscription/]. Note that purchasing BitCash is no longer required for players in North America, as the [e-amusement] website now accepts non-Japanese credit cards for payment.\n"},{"term":"e-amusement extended maintenance","aka":["Third Monday","Maintenance Monday"],"concept":"Online features","definition":"A recurring time period during which the [e-amusement] service is unavailable for all [Bemani] games, on the third Tuesday of every month in Japan from 2:00-7:00 AM. In North America, this corresponds to sometime midday on the previous calendar Monday, depending on the timezone. For example, in Pacific Daylight Time the maintenance window lasts from 10:00 AM to 3:00 PM.\n\nDuring this time, DDR [cabinets|cabinet] are effectively offline; [Premium Play] can't be used and play data won't be saved.\n"},{"term":"Leaderboard","aka":["LB"],"concept":"Online features","definition":"An in-game display of some of the highscores on a [chart]. Leaderboards typically show the [world record|WR], regional record, and [machine record], as well as the player's [personal record|PB] and those of up to 3 of their rivals (if they have configured this feature on the [e-amusement] website). These records are sorted by score and display the player's name and the score they obtained."},{"term":"PB","acronym":"Personal Best","concept":"Online features","aka":["Improvement","Personal Record","Upscore (slang)"],"definition":"A [score] on a [chart] that exceeds the player's previous highscore. The player's personal record is displayed on the [leaderboard] on the song selection screen, as well as next to the list of charts for the selected [song]."},{"term":"WR","acronym":"World Record","concept":"Online features","definition":"A [score] on a [chart] that exceeds *all* other scores on that chart. The player and score associated with this record are displayed at the top of the [leaderboard] on the song selection screen.","trivia":"In DDR, tying a world record replaces the old record on the leaderboards, although players generally qualify this as a \"tied WR\" regardless of how the game treats it."},{"term":"Machine Record","concept":"Online features","definition":"A [score] on a [chart] that exceeds all other scores on that chart that were obtained on the same [cabinet]. The player and score associated with this record are displayed near the top of the [leaderboard] on the song selection screen."},{"term":"Pattern","concept":"Patterns","definition":"A particular sequence of [notes|note], typically categorized by the techniques required to hit the notes rather than the specific arrows involved.  For example, a [crossover] pattern can involve many different sequences of notes, as long as the result of hitting the arrows normally results in one leg \"crossing over\" the other.\n\n\"Pattern\" can also be synonymous with \"[chart]\", although this is uncommon among English-speaking players.\n"},{"term":"Crossover","concept":"Patterns","definition":"A [pattern] which normally requires the player to cross one leg over the other.\n"},{"term":"Lateral crossover","aka":["Laterals","Scoobie (slang)"],"concept":"Patterns","definition":"A specific type of [crossover] pattern in which the player's left and right feet are momentarily positioned on the *right* and *left* [panels|panel], respectively.\n\nThe informal term \"scooby\" or \"scoobies\" refers to rapid-fire lateral crossovers, such as those seen near the end of [song:Mei] [CSP].\n"},{"term":"Double-step","concept":"Patterns","definition":"A [pattern] in which the same foot is used to hit two consecutive [notes|note] on different [panels|panel]. These are most often seen in conjunction with [freeze notes|freeze note], where one foot is anchored to a particular panel and the other foot must hit notes on the other three panels.\n\nMore generally, double-stepping is a technique that players can use to hit any pattern, especially [crossovers|crossover]. There are a variety of reasons to do this; some players may find it more difficult to time their steps precisely when their legs are crossed over, or may struggle to [combo] crossovers due to missing the panels. Players may also use double-steps to strategically orient their body in preparation for an upcoming pattern.\n"},{"term":"Jack","concept":"Patterns","definition":"A [pattern] in which multiple consecutive [notes] must be hit on the same [panel]. These patterns are typically executed by using the same foot to hit each note, although players may choose to alternate feet, depending on which panel is used and how fast the arrows must be hit.\n"},{"term":"Footswitch","concept":"Patterns","definition":"A [pattern] in which two [notes] on the same [panel], typically Up or Down, are intended to be hit with alternating feet rather than the same foot twice.\n\nFootswitches can be difficult to distinguish from short [jacks|jack].  In general, if footswitching a repeated note avoids a [double-step] in the near future, it's more likely to be the \"intended\" technique.\n"},{"term":"Step-jumps","aka":["Jump-steps"],"concept":"Patterns","definition":"A [pattern] in which [jumps|jump] and single [notes|note] are interwoven such that every other note is a jump. Typically, the single notes that separate the jumps will be on the same panel as one or both of the surrounding jumps' panels. For example, [song:Sumidagawa] [CSP] makes heavy use of step-jumps during the chorus.\n"},{"term":"Stream","aka":["Run"],"concept":"Patterns","definition":"A [pattern] characterized by a monotonic sequence of single [notes|note] on different panels. For example, [song:Healing Vision ~angelic mix~] [ESP] ends with a long stream of [8th notes|quantization], and [song:Nageki no ki] [ESP] has a long 16th note stream towards the end.\n"},{"term":"YB","acronym":"Yabai","aka":["やばい"],"concept":"Community Lingo","definition":"\"Yabai\" / \"やばい\", a Japanese slang term used by DDR players that roughly translates to \"OMG\" or \"awesome\".\n"},{"term":"HYF","acronym":"How You Figure","aka":["HYFF"],"concept":"Community Lingo","definition":"\"How You Figure\" or \"How You F---in' Figure\", an informal acronym expressing incredulity, usually directed at some accomplishment by another player.\n"},{"term":"MAW","acronym":"Might As Well...","aka":["MAWM","MAWP"],"concept":"Community Lingo","definition":"\"Might As Well ([Piff|PFC] / [Miff|MFC])\", an informal acronym typically used in response to a score that's nearly a [PFC] or [MFC].\n\nWhen used in response to someone else's score, the term has positive connotations; it implies that the PFC / MFC is well within the player's reach, and they \"might as well\" replay it to achieve that score.\n"},{"term":"Can check","concept":"Community Lingo","definition":"A social media catchphrase that's usually attached to a photo of the player's drink before or during their DDR [session].\n"},{"term":"Corny","aka":["🌽","cornafrn"],"concept":"Community Lingo","definition":"Highly contextual social media slang. In the context of a [score] post, \"corny [MA]\" or \"corny [chart]\" usually has negative connotations. However, replies containing the corn emoji (🌽) and neologisms involving \"corn\" are typically positive, meant to compare the score to the player who popularized the \"corn\" meme, CHRS4LFE.\n"}]