[{"term": "Cabinet", "aka": ["Game cabinet", "Cab"], "concept": "Hardware", "definition": "The physical unit that houses the game display, navigation buttons, [e-amusement](#term-e-amusement) scanner, and the computer running the game. The cabinet connects to a [dance stage](#term-dance-stage) to register player inputs."}, {"term": "Dance stage", "aka": ["Stage", "Dance pad", "Pad"], "concept": "Hardware", "definition": "The physical box that houses the [panels](#term-panel) and connects to the main [game cabinet](#term-cabinet). Players typically stand on this stage during gameplay."}, {"term": "Panel", "concept": "Hardware", "definition": "One of the primary gameplay inputs, typically activated by a player stepping onto it. There are four panels per side, for a total of eight panels on a standard [dance stage](#term-dance-stage)."}, {"term": "Receptors", "concept": "Gameplay elements", "definition": "The visual element typically seen at the top of the screen (sometimes bottom, sometimes hidden) used by players to determine when to hit each [note](#term-note). Each [panel](#term-panel) being used in the current gameplay mode has a corresponding arrow-shaped receptor towards which notes will scroll. The receptors flash in sync with the music on each quarter note."}, {"term": "Note", "concept": "Gameplay elements", "definition": "The main scoring element during gameplay, represented visually by an arrow scrolling towards the [receptors](#term-receptors). Players try to step on the corresponding [panel](#term-panel) as close as possible to the moment when the arrow coincides with its receptor; the game assigns them a [judgement](#term-judgement) based on how precisely they timed their step."}, {"term": "Jump", "concept": "Gameplay elements", "definition": "Two different [notes](#term-note) on the same horizontal row, typically hit by jumping with both feet onto the corresponding [panels](#term-panel)."}, {"term": "Freeze note", "concept": "Gameplay elements", "aka": ["Freeze", "Hold note", "Hold"], "definition": "A special [note](#term-note) where the player must keep the corresponding [panel](#term-panel) pressed until the \"tail\" of the freeze note has passed.", "trivia": "Freeze notes were introduced in DDRMAX -DanceDance Revolution 6thMIX-."}, {"term": "Shock arrow", "concept": "Gameplay elements", "aka": ["Shock notes", "Shocks"], "definition": "A special gameplay element represented visually by four lightning-strung arrows in a row scrolling towards the [receptors](#term-receptors). Players must avoid standing on the corresponding [panels](#term-panels) when it passes in order to avoid triggering the shock arrow, which causes a [miss](#term-miss) and briefly obscures the scrolling notes.", "trivia": "Shock arrows were introduced in DanceDanceRevolution X."}, {"term": "SP", "acronym": "Single Play", "aka": ["Singles"], "concept": "Modes & Stages", "definition": "Gameplay mode where one player plays on one side of the [dance stage](#term-dance-stage) (four [panels](#term-panels)). Also refers to the [charts](#term-chart) accessible through this mode and [Versus Play](#term-versus-play)."}, {"term": "DP", "acronym": "Double Play", "aka": ["Doubles"], "concept": "Modes & Stages", "definition": "Gameplay mode where one player plays on both sides of the [dance stage](#term-dance-stage) (eight [panels](#term-panels)). Also refers to the [charts](#term-chart) accessible through this mode."}, {"term": "Versus Play", "concept": "Modes & Stages", "definition": "Gameplay mode where two players play on one side of the [dance stage](#term-dance-stage) each (four [panels](#term-panels) each). Both players must share [song](#term-song) picks for each [stage](#term-stage), but can select different [single](#term-sp) charts and [options](#term-option) for themselves."}, {"term": "Session", "aka": ["Set"], "concept": "Modes & Stages", "definition": "The unit of gameplay purchased with each card swipe at an arcade. Players typically start each session by swiping their [e-amusement](#term-e-amusement) pass and choosing their gameplay mode, then play 3-4 [stages](#term-stage) (depending on the [cabinet](#term-cabinet)'s configuration and whether they meet the requirements for an [Extra Stage](#term-extra-stage)), and then optionally review their results at the end of the session."}, {"term": "Stage", "aka": ["Round"], "concept": "Modes & Stages", "definition": "The unit of gameplay associated with a player's choice of [song](#term-song) and [chart](#term-chart). Most [cabinets](#term-cabinet) are configured for 3 stages per [session](#term-session), with the possibility of gaining an [Extra Stage](#term-extra-stage) after the normal stages. Some songs can only be played during the [Final Stage](#term-final-stage), and others yet are gated behind the Extra Stage.\n\n[Premium Play](#term-premium-play) guarantees that all 3 stages will be played, regardless of whether the player [fails](#term-fail) or not. Without Premium Play, failing a stage ends the session immediately.\n"}, {"term": "Final Stage", "concept": "Modes & Stages", "definition": "The last of the normal [stages](#term-stage), typically the third stage. Some event [songs](#term-song) may be exclusive to this stage. In order to access the [Extra Stage](#term-extra-stage), the Final Stage *must* be [cleared](#term-clear), in addition to other requirements.\n"}, {"term": "Extra Stage", "concept": "Modes & Stages", "definition": "A bonus [stage](#term-stage) that can be gained at the end of a [session](#term-session) using [Premium Play](#term-premium-play). Extra Stage can be used to unlock [Extra Savior](#term-extra-savior) songs and play [Extra Exclusive](#term-extra-exclusive) songs, but it forces the [LIFE4](#term-life4) gauge and ends the stage immediately if all players [fail](#term-fail).\n\nIn order to access this stage, the [Final Stage](#term-final-stage) must be cleared with a total of 9 \"result stars\" that are obtained by [clearing](#term-clear) songs, achieving certain [grades](#term-grade), getting a [Full Combo](#term-fc), and playing with a harder [life gauge](#term-life-gauge) option. On [DDR A](#term-dancedancerevolution-a) only, result stars are also automatically added to a player's account after each session when they have reached certain [Heat Power](#term-heat-power) levels.\n\nDuring rare events, it's possible to obtain yet *another* stage after this one: the [Encore Extra Stage](#term-encore-extra-stage).\n\nFull details on the Extra Stage requirements and exclusive songs can be found on RemyWiki's [DDR A](https://remywiki.com/AC_DDR_A#EXTRA_STAGE) and [DDR A20](https://remywiki.com/AC_DDR_A20#EXTRA_STAGE) pages.\n"}, {"term": "Extra Exclusive", "concept": "Modes & Stages", "definition": "A special [song](#term-song) folder that can only be accessed in the [Extra Stage](#term-extra-stage), containing songs that are temporarily exclusive to the Extra Stage."}, {"term": "Extra Savior", "concept": "Modes & Stages", "definition": "An unlock mechanic consisting of a variety of special [song](#term-song) folders that can only be accessed in the [Extra Stage](#term-extra-stage). The exact unlock mechanics vary from event to event, but in general, clearing an Extra Savior [chart](#term-chart) will unlock it for play during normal [stages](#term-stage), and unlocking all charts for a song will remove it from the Extra Savior folder (as it can be found in the corresponding DDR mix [folder](#term-sorting)).\n\nFull details on the unlock requirements for Extra Savior songs can be found on RemyWiki's [DDR A](https://remywiki.com/AC_DDR_A#Unlockable_Songs) and [DDR A20](https://remywiki.com/AC_DDR_A20#Unlockable_Songs) pages.\n"}, {"term": "Heat Power", "concept": "Modes & Stages", "definition": "A [DDR A](#term-dancedancerevolution-a) exclusive mechanic that primarily affects the [Extra Stage](#term-extra-stage). Heat Power is represented by a 7-bar gauge that starts empty on each day (divided by [e-amusement](#term-e-amusement) maintenance periods) and increases by one after every [session](#term-session) a player completes on [Premium Play](#term-premium-play). At 3 bars, the player enters Heat Power level 2, and at a full 7 bars the player enters Heat Power level 3.\n\nSome [Extra Exclusive](#term-extra-exclusive) songs can only be played at a particular Heat Power level. Additionally, higher Heat Power levels provide the player with bonus \"result stars\" that make it easier to obtain the [Extra Stage](#term-extra-stage) (level 2 gives 3 stars and level 3 gives 9 stars).\n"}, {"term": "Encore Extra Stage", "aka": ["One More Extra Stage", "OMES"], "concept": "Modes & Stages", "definition": "A special [stage](#term-stage) following the [Encore Stage](#term-encore-stage) that can only be accessed during certain events. This stage does not allow the player to control the [song](#term-song), [chart](#term-chart), or [options](#term-option), and the stage ends immediately if the player receives a [judgement](#term-judgement) of [Great](#term-great), [Good](#term-good), or [Miss](#term-miss). Currently, there is no way to access the Encore Extra Stage as there is no active event that makes use of it.\n", "trivia": "The last time Encore Extra Stage was accessible ranged from July 12, 2017 to April 26, 2018, during the \"Rinon's Adventure\" event finale for [DDR A](#term-dancedancerevolution-a). Clearing the [Extra Exclusive](#term-extra-exclusive) song ENDYMION on [Expert](#term-expert) with a [grade](#term-grade) of AA+ or higher would trigger the Encore Extra Stage with the song ACE FOR ACES on [Difficult](#term-difficult). The [difficulty](#term-difficulty) requirements were gradually relaxed over the following months until ACE FOR ACES was ultimately made available outside of the Encore Extra Stage."}, {"term": "Song", "concept": "Charts", "definition": "You know, like, music. Every song has a jacket (square artwork) and a number of [charts](#term-chart) associated with it - no more than one per [difficulty](#term-difficulty) per gameplay mode ([SP](#term-sp) or [DP](#term-dp)).\n\n\"Song\" is often informally used as a synonym for [stage](#term-stage).\n"}, {"term": "Chart", "aka": ["Pattern"], "concept": "Charts", "definition": "A gameplay sequence for a particular song. Each chart has a [difficulty](#term-difficulty), [meter](#term-meter), and [groove radar](#term-groove-radar) displayed on the song selection screen. During gameplay, the chart lays out where notes (and other gameplay elements like [shock arrows](#term-shock-arrows) and [speed changes](#term-speed-change)) are placed."}, {"term": "Speed change", "aka": ["Speed gimmick", "Gimmick", "Timing change", "Timing gimmick"], "concept": "Gameplay elements", "definition": "Speed changes include [BPM changes](#term-bpm-change) and [stops](#term-stop). These are typically shared across all [charts](#term-chart) for a [song](#term-song), although on rare occasions specific charts may have separate speed changes from the other charts. There is no visual indication that a speed change is about to occur, so players may wish to memorize the locations of speed changes for some songs.", "trivia": "The only songs that have different speed changes for different charts are ACE FOR ACES ([Beginner](#term-beginner)/[Basic](#term-basic) have no speed changes, all other difficulties have their own distinct speed changes) and CHAOS Terror-Tech Mix (only [Challenge](#term-challenge) has separate speed changes)."}, {"term": "BPM change", "concept": "Gameplay elements", "definition": "A [speed change](#term-speed-change) where the scroll speed increases or decreases. These typically occur in powers of two, i.e. doubling or halving the scroll speed, and are typically placed to follow the subjective \"intensity\" of the song.\n\nBPM changes can also be used in very small increments to correct the timing on \"drifty\" songs.\n"}, {"term": "Stop", "aka": ["Stutter gimmick", "Stutter"], "concept": "Gameplay elements", "definition": "A [speed change](#term-speed-change) where the scroll speed comes to a complete halt. These are typically placed to accent moments in the song where the music goes quiet, or on particular percussive hits.\n\nRapid-fire stops can create what players call a \"stutter gimmick\", where the scroll speed is effectively reduced in a choppy motion without any [BPM change](#term-bpm-change).\n"}, {"term": "Judgement", "concept": "Scores", "definition": "An indicator of how precisely the player hit a [note](#term-note), with respect to timing. Every judgement has an associated timing window that determines how early or late a note may be hit, compared to the exact timing of the note. Judgements with smaller timing windows take precedence over those with larger timing windows. After each [stage](#term-stage), the players can review how many times they received each judgement on the results screen. The judgements are [Marvelous](#term-marvelous), [Perfect](#term-perfect), [Great](#term-great), [Good](#term-good), [OK](#term-ok), and [Miss](#term-miss)."}, {"term": "Marvelous", "aka": ["Marvs (slang)"], "concept": "Scores", "definition": "The best [note judgement](#term-judgement), above [Perfect](#term-perfect). The timing window for the Marvelous judgement is 16.666… ms. The [score](#term-score) gained from each Marvelous is determined by dividing the maximum score of 1,000,000 by the maximum number of Marvelous and [OK](#term-ok) judgements that can be obtained in the current chart.\n\nIf the maximum score described above isn't a multiple of 10 on the current [stage](#term-stage) (which it usually won't be), the score will actually fluctuate on a note-by-note basis between the surrounding multiples of 10, such that the total adds up to exactly 1,000,000.\n", "trivia": "The Marvelous judgement was introduced in DanceDanceRevolution EXTREME, but only in courses. It was introduced to normal gameplay in DDR SuperNOVA2. Prior to its introduction, Perfect was the best note judgement - hence the odd naming convention."}, {"term": "Perfect", "aka": ["Perfs (slang)", "P"], "concept": "Scores", "definition": "The second-best [note judgement](#term-judgement), below [Marvelous](#term-marvelous) and above [Great](#term-great). The timing window for the Perfect judgement is 33.333… ms. The [score](#term-score) obtained from each Perfect is the corresponding Marvelous score minus 10."}, {"term": "Great", "aka": ["G"], "concept": "Scores", "definition": "The third-best [note judgement](#term-judgement), below [Perfect](#term-perfect) and above [Good](#term-good). The timing window for the Great judgement is about 92 ms TODO CONFIRM. The [score](#term-score) obtained from each Great is the corresponding Perfect score times 60%, rounded down to a multiple of 10."}, {"term": "Good", "concept": "Scores", "definition": "The fourth-best [note judgement](#term-judgement), below [Great](#term-great). The timing window for the Good judgement is about 142 ms TODO CONFIRM. The [score](#term-score) obtained from each Good is the corresponding Perfect score times 20%, rounded down to a multiple of 10."}, {"term": "OK", "concept": "Scores", "definition": "A pseudo-[judgement](#term-judgement) obtained by holding a [freeze note](#term-freeze-note) to its end or avoiding a [shock arrow](#term-shock-arrow). There is no timing window associated with this judgement. The [score](#term-score) gained from each OK is the same as [Marvelous](#term-marvelous)."}, {"term": "Miss", "aka": ["M"], "concept": "Scores", "definition": "Failing to hit an arrow within the widest timing window (namely [Good](#term-good)) incurs a Miss, as does dropping a [freeze note](#term-freeze-note) or triggering a [shock arrow](#term-shock-arrow). Obtaining a miss will reset the player's [combo](#term-combo) back to zero and decrease the [life gauge](#term-life-gauge) (unless it is already empty). Misses do not increase or decrease the player's [score](#term-score)."}, {"term": "Pad miss", "concept": "Scores", "definition": "Informal term for a [miss](#term-miss) judgement that the player believes the game registered erroneously. The [panels](#term-panel), like any piece of hardware, are not perfect and can malfunction or require different pressure compared to other panels, especially if poorly maintained."}, {"term": "Combo", "concept": "Combos & Lamps", "definition": "An indicator of how many notes the player has hit consecutively without obtaining any [misses](#term-miss). [Jumps](#term-jump) and avoided [shock arrows](#term-shock-arrow) both increment the combo by one; holding [freeze notes](#term-freeze-note) to the end does not increment the combo.\n\nMaintaining a combo until the end of the song is known as a \"Full Combo\" or [FC](#term-fc), although this is usually further qualified with the lowest judgement obtained: [GFC](#term-gfc), [PFC](#term-pfc), or [MFC](#term-mfc).\n"}, {"term": "MFC", "acronym": "Marvelous Full Combo", "aka": ["Marvelous Sweep", "Miff (slang)"], "concept": "Combos & Lamps", "definition": "A score obtained by getting a [Marvelous](#term-marvelous) judgement on every step, with no [Misses](#term-miss). This is the highest score in the game, corresponding to a [money score](#term-score) of 1,000,000.\n\nThe [sort folder](#term-sorting) for MFCs is labeled \"MARVELOUS SWEEP\".\n", "trivia": "All [Single](#term-sp) charts [rated](#term-meter) 14 and lower have been MFC'd by at least one player. No Single charts rated 18 or higher have been MFC'd by anyone."}, {"term": "PFC", "acronym": "Perfect Full Combo", "aka": ["Piff (slang)"], "concept": "Combos & Lamps", "definition": "A score obtained by getting either a [Marvelous](#term-marvelous) or [Perfect](#term-perfect) judgement on every step, with no [Misses](#term-miss). The [score](#term-score) for a PFC will be 1,000,000 minus the number of Perfect judgements received times ten.", "trivia": "All [Single](#term-sp) charts [rated](#term-meter) 18 and lower have been PFC'd by at least one player. Only one PFC on a 19 has ever been recorded: [CHRS4LFE's PFC of EGOISM 440](https://www.youtube.com/watch?v=QWCXAdaj2Vs) on December 13, 2017."}, {"term": "GFC", "acronym": "Great Full Combo", "concept": "Combos & Lamps", "definition": "A score obtained by getting either a [Marvelous](#term-marvelous), [Perfect](#term-perfect), or [Great](#term-great) judgement on every step, with no [Misses](#term-miss).", "trivia": "The [score](#term-score) for any GFC will typically be lower than any PFC on the same chart, due to Greats costing significantly more points off of the maximum than Perfects, although this is not always the case."}, {"term": "FC", "acronym": "Full Combo", "aka": ["Good Full Combo", "Blue Full Combo", "BFC"], "concept": "Combos & Lamps", "definition": "A score obtained by [clearing](#term-clear) a [stage](#term-stage) with no [Misses](#term-miss). [Good](#term-good) judgements do not break combo in [DDR A](#term-ddr-a), so a FC is distinct from (and more permissive than) a [GFC](#term-gfc).", "trivia": "Except for ENDYMION [CSP](#term-csp) and MAX 360 CSP, all [Single](#term-sp) charts have been FC'd by at least one player. This is confirmed in [a video by BROSONI.](https://www.youtube.com/watch?v=MYq0vMinbM4) from 2016 showing a blue [lamp](#term-lamp) on the LEVEL SORT 19 [folder](#term-folder), plus the fact that all SP charts [rated](#term-meter) 18 and lower have been [PFC](#term-pfc)'d."}, {"term": "Life gauge", "concept": "Gameplay elements", "definition": "An indicator of the player's performance, displayed above the [receptors](#term-receptors). The normal life gauge is a continuous meter that starts out half-full, rises slowly as combo increases, and depletes quickly when the player incurs a [miss](#term-miss). The normal gauge can be replaced with the [LIFE4](#term-life4) or [RISKY](#term-risky) gauge in the player's modifiers before each song. Depleting the life gauge completely results in a [failing](#term-fail) grade, and the player's [score](#term-score) is frozen."}, {"term": "LIFE4", "aka": ["hard clear"], "concept": "Options", "definition": "A [life gauge](#term-life-gauge) mode where the player starts the song with 4 \"lives\" that can be lost by obtaining [Miss](#term-miss) judgements. The gauge display above the [receptors](#term-receptors) is replaced with four discrete cells indicating how many lives remain. Lives cannot be regained during the song. Losing all four lives has the same effect as depleting the normal life gauge.\n\nDuring [Extra Stage](#term-extra-stage), the life gauge is forced onto LIFE4 mode, and losing all four lives will additionally obscure the notefield for that player (either with a \"Game Over\" display if another player is still playing, or by transitioning to the \"Failed\" screen immediately otherwise).\n", "trivia": "All [SP](#term-sp) charts have been LIFE4 cleared by at least one player.\n\n\"LIFE4\" also refers to the community-led [LIFE4 ranking system](#term-life4-ranking-system)(https://life4ddr.com/).\n"}, {"term": "RISKY", "concept": "Options", "definition": "A [life gauge](#term-life-gauge) mode where the player starts the song with 1 \"life\" that can be lost by obtaining a [Miss](#term-miss) judgement. The gauge display appears the same as the [LIFE4](#term-life4) gauge, except the first three cells are already empty when the song starts. The song immediately ends if all players [fail](#term-fail) on the RISKY life gauge.\n\nBy definition, clearing a song using the RISKY life gauge is at minimum a [FC](#term-fc), so there is no separate [clear level](#term-lamp) for RISKY clears.\n"}, {"term": "Clear", "aka": ["Pass"], "concept": "Scores", "definition": "Completing a [stage](#term-stage) without [failing](#term-fail) due to the [life gauge](#term-life-gauge) depleting. Clears are assigned a [letter grade](#term-grade) from D to AAA and are eligible for various [lamps](#term-lamp) contingent on modifiers and full [combo](#term-combo)-based clear levels."}, {"term": "Assist clear", "concept": "Scores", "definition": "Completing a [stage](#term-stage) without [failing](#term-fail), but with the use of an [option](#term-option) that removes notes or other scoring elements from gameplay. Using any of the non-default choices under the \"Cut\", \"Freeze Arrow\", or \"Jumps\" options will count as an assist clear for the purpose of [lamps](#term-lamp)."}, {"term": "Fail", "aka": ["Game over"], "concept": "Scores", "definition": "Ending a [stage](#term-stage) with a depleted [life gauge](#term-life-gauge). Fails are assigned a [letter grade](#term-grade) of E, although the score the player obtained prior to the life gauge depleting is equally valid as a score obtained by [clearing](#term-clear) the stage."}, {"term": "Score", "aka": ["Money score"], "concept": "Scores", "definition": "A numeric indicator of a player's accuracy & timing precision on a given [stage](#term-stage), ranging from 0 to 1,000,000. The score is a cumulative measure of the scores corresponding to the [judgements](#term-judgement) they received on each [note](#term-note) (and [freeze note](#term-freeze-note) and [shock arrow](#term-shock-arrow)). Sometimes called \"money score\" to differentiate from [EX score](#term-ex-score).\n\n\"Score\" can also refer to the more general results of a [stage](#term-stage), without strictly meaning the numeric score.\n"}, {"term": "EX score", "aka": ["EX points", "EX"], "concept": "Scores", "definition": "An alternative scoring method where judgements are assigned the following weights:\n\n* [Marvelous](#term-marvelous) & [OK](#term-ok): 3\n* [Perfect](#term-perfect): 2\n* [Great](#term-great): 1\n* [Good](#term-good) & [Miss](#term-miss): 0\n\nEX score is displayed on the results screen below the [judgement](#term-judgement) counts. In [Event Mode](#term-event-mode), the normal score and EX score displays may be swapped.\n", "trivia": "This scoring method is favored in tournaments over [money score](#term-score) because it assigns comparable weights to Perfects and Greats, unlike the standard scoring system where, for example, nearly any reasonable [PFC](#term-pfc) would beat a near-[MFC](#term-mfc) missed by only one great."}, {"term": "Grade", "aka": ["Letter grade", "Rank"], "concept": "Scores", "definition": "A letter-based rank assigned to a player's performance on a [stage](#term-stage), based on their [score](#term-score) and whether they [cleared](#term-clear) or [failed](#term-fail) the stage. Here are the grades and their conditions:\n\n* AAA: Clear with a score of 990,000 or higher.\n* AA+: Clear with a score between 950,000 (inclusive) and 990,000 (exclusive).\n* AA: Clear with a score between 900,000 (inclusive) and 950,000 (exclusive).\n* AA-: Clear with a score between 890,000 (inclusive) and 900,000 (exclusive).\n* A+: Clear with a score between 850,000 (inclusive) and 890,000 (exclusive).\n* A: Clear with a score between 800,000 (inclusive) and 850,000 (exclusive).\n* A-: Clear with a score between 790,000 (inclusive) and 800,000 (exclusive).\n* B+: Clear with a score between 750,000 (inclusive) and 790,000 (exclusive).\n* B: Clear with a score between 700,000 (inclusive) and 750,000 (exclusive).\n* B-: Clear with a score between 690,000 (inclusive) and 700,000 (exclusive).\n* C+: Clear with a score between 650,000 (inclusive) and 690,000 (exclusive).\n* C: Clear with a score between 600,000 (inclusive) and 650,000 (exclusive).\n* C-: Clear with a score between 590,000 (inclusive) and 600,000 (exclusive).\n* D+: Clear with a score between 550,000 (inclusive) and 590,000 (exclusive).\n* D: Clear with a score below 550,000.\n* E: Fail with any score.\n", "trivia": "Prior to DanceDanceRevolution SuperNOVA2, \"AAA\" was synonymous with [PFC](#term-pfc), as the [Marvelous](#term-marvelous) judgement had not been introduced yet. The ensuing change in semantics was met with… mixed responses from the DDR community at the time."}, {"term": "Lamp", "aka": ["Song lamp", "Folder lamp"], "concept": "Combos & Lamps", "definition": "A visual indicator of the highest clear level a player has obtained on a [song](#term-song) or [folder](#term-sorting). On the song selection screen, lamps appear as two colored bars on the sides of each song jacket or folder entry. In [Versus Mode](#term-versus-mode), each bar corresponds to each player; otherwise, both bars correspond to the single player.\n\n*Song lamps* are independent of the player's high score; obtaining a higher score with a lower clear level does not decrease the lamp's clear level. *Folder lamps* correspond to the lowest clear level in the folder; for example, to obtain a [FC](#term-fc) folder lamp, every song in the folder must have a FC or higher clear level.\n\nHere is the ordering and lamp color of the different clear levels:\n\n* [MFC](#term-mfc) (flashing white)\n* [PFC](#term-pfc) (flashing gold)\n* [GFC](#term-gfc) (flashing green)\n* [FC](#term-fc) (flashing blue)\n* [LIFE4 clear](#term-life4) (red / white)\n* [normal clear](#term-clear) (yellow)\n* [assist clear](#term-assist-clear) (purple)\n* [failed](#term-fail) (dark amber)\n* not played (black)\n", "trivia": "On [SP](#term-single-play), the highest level folder on which any player has obtained an [MFC](#term-mfc) lamp is 14 (by CHRS4LFE). For [PFC](#term-pfc) lamps, the highest is 18, obtained by multiple players. Currently, no player has documented a clear level higher than the normal clear lamp on the SP 19 folder (although BROSONI. had a FC lamp prior to ENDYMION [CSP](#term-csp)'s release)."}, {"term": "White Lamp", "concept": "Combos & Lamps", "definition": "A [lamp](#term-lamp) corresponding to the [MFC](#term-mfc) clear level. Appears on songs you've MFC'd and folders where you've MFC'd all of the songs."}, {"term": "Gold Lamp", "concept": "Combos & Lamps", "definition": "A [lamp](#term-lamp) corresponding to the [PFC](#term-pfc) clear level. Appears on songs you've PFC'd and folders where you've PFC'd, but not necessarily MFC'd, all of the songs."}, {"term": "Green Lamp", "concept": "Combos & Lamps", "definition": "A [lamp](#term-lamp) corresponding to the [GFC](#term-gfc) clear level. Appears on songs you've GFC'd and folders where you've GFC'd, but not necessarily PFC'd, all of the songs."}, {"term": "Blue Lamp", "concept": "Combos & Lamps", "definition": "A [lamp](#term-lamp) corresponding to the [FC](#term-fc) clear level. Appears on songs you've FC'd and folders where you've FC'd, but not necessarily GFC'd, all of the songs."}, {"term": "Red Lamp", "aka": ["LIFE4 Lamp"], "concept": "Combos & Lamps", "definition": "A [lamp](#term-lamp) corresponding to the [LIFE4](#term-life4) clear level. Appears on songs you've cleared on the LIFE4 gauge and folders where you've LIFE4 cleared, but not necessarily [comboed](#term-fc), all of the songs normally."}, {"term": "Clear Lamp", "aka": ["Yellow Lamp"], "concept": "Combos & Lamps", "definition": "A [lamp](#term-lamp) corresponding to the [normal clear](#term-clear) level. Appears on songs you've cleared normally and folders where you've cleared, but not necessarily [LIFE4](#term-life4) cleared or [comboed](#term-fc), all of the songs normally."}, {"term": "Purple Lamp", "aka": ["Assist Lamp", "Cut Lamp"], "concept": "Combos & Lamps", "definition": "A [lamp](#term-lamp) corresponding to the [assist clear](#term-assist-clear) level. Appears on songs you've only cleared with an assist option enabled and folders where you've cleared all of the songs, but some only with an assist option enabled."}, {"term": "Fail Lamp", "aka": ["Dark Lamp"], "concept": "Combos & Lamps", "definition": "A [lamp](#term-lamp) corresponding to the [failed](#term-fail) clear level. Appears on songs you've only failed and folders where you've attempted, but not necessarily cleared, all of the songs."}, {"term": "Black Lamp", "concept": "Combos & Lamps", "definition": "A [lamp](#term-lamp) corresponding to the unplayed clear level. Appears on songs you haven't played and folders where you haven't played at least one of the songs.", "trivia": "Also the name of a notorious ITG custom song."}, {"term": "Difficulty", "concept": "Charts", "definition": "One of five slots for [charts](#term-chart) in ascending order of, well, difficulty. These include [Beginner](#term-beginner) ([SP](#term-sp) only), [Basic](#term-basic), [Difficult](#term-difficult), [Expert](#term-expert), and [Challenge](#term-challenge) (only on some songs).", "trivia": "Some older songs have [Challenge](#term-challenge) charts that are actually easier than the [Expert](#term-expert) chart, as this slot was originally used for more \"experimental\" gameplay techniques, rather than simply harder techniques."}, {"term": "Meter", "concept": "Charts", "aka": ["Rating", "Level"], "definition": "A number assigned to each [chart](#term-chart) denoting how hard it is to [clear](#term-clear) relative to all other charts in the game. Currently, meters range from 1 to 19.", "trivia": "Prior to DanceDanceRevolution X, meters ranged from 1 to 10. During this time, 10s corresponded to charts as easy as modern-day 13s and as hard as modern-day 18s - perhaps you can see why the scale was expanded."}, {"term": "Beginner", "concept": "Charts", "definition": "The easiest [difficulty](#term-difficulty) in the game on [SP](#term-sp), below [Basic](#term-basic). Beginner charts typically range in [meter](#term-meter) from 1 to 5, but can go as high as 9 on some boss songs."}, {"term": "Basic", "concept": "Charts", "definition": "The [difficulty](#term-difficulty) above [Beginner](#term-beginner) ([SP](#term-sp) only) and below [Difficult](#term-difficult). On [DP](#term-dp), this is the easiest difficulty. Basic charts typically range in [meter](#term-meter) TODO"}, {"term": "Difficult", "concept": "Charts", "definition": "The [difficulty](#term-difficulty) above [Basic](#term-basic) and below [Expert](#term-expert). Difficult charts typically range in [meter](#term-meter) TODO"}, {"term": "Expert", "concept": "Charts", "definition": "The [difficulty](#term-difficulty) above [Difficult](#term-difficult) and below [Challenge](#term-challenge), when present. Expert charts typically range in [meter](#term-meter) from 9 to 17, but can go as low as 5 TODO CONFIRM on some older songs and as high as 18 on some boss songs."}, {"term": "Challenge", "concept": "Charts", "definition": "The [difficulty](#term-difficulty) above [Expert](#term-expert). Only some [songs](#term-song) have a Challenge [chart](#term-chart); those that do will have one on both [SP](#term-sp) and [DP](#term-dp). Challenge charts typically range in [meter](#term-meter) from 10 to 18, but can go as low as 8 TODO CONFIRM on some older songs and as high as 19 on some boss songs.", "trivia": "A small number of songs *only* have Challenge charts available; players must use an [e-amusement](#term-e-amusement) pass to access these songs, in order to prevent casual players from accidentally selecting them."}, {"term": "BSP", "acronym": "Basic Single Pattern", "concept": "Charts", "definition": "*BSP* refers to [Basic](#term-basic) [Single](#term-sp) [Pattern](#term-chart); a double chart in the Basic difficulty slot.\n\n*bSP* (with a lowercase \"b\") refers to [Beginner](#term-beginner) [Single](#term-sp) [Pattern](#term-chart).\n"}, {"term": "BDP", "acronym": "Basic Double Pattern", "concept": "Charts", "definition": "A [double](#term-dp) [chart](#term-chart) in the [Basic](#term-basic) difficulty slot."}, {"term": "DSP", "acronym": "Difficult Single Pattern", "concept": "Charts", "definition": "A [single](#term-sp) [chart](#term-chart) in the [Difficult](#term-difficult) difficulty slot."}, {"term": "DDP", "acronym": "Difficult Double Pattern", "concept": "Charts", "definition": "A [double](#term-dp) [chart](#term-chart) in the [Difficult](#term-difficult) difficulty slot."}, {"term": "ESP", "acronym": "Expert Single Pattern", "concept": "Charts", "definition": "A [single](#term-sp) [chart](#term-chart) in the [Expert](#term-expert) difficulty slot."}, {"term": "EDP", "acronym": "Expert Double Pattern", "concept": "Charts", "definition": "A [double](#term-dp) [chart](#term-chart) in the [Expert](#term-expert) difficulty slot."}, {"term": "CSP", "acronym": "Challenge Single Pattern", "concept": "Charts", "definition": "A [single](#term-sp) [chart](#term-chart) in the [Challenge](#term-challenge) difficulty slot."}, {"term": "CDP", "acronym": "Challenge Double Pattern", "concept": "Charts", "definition": "A [double](#term-dp) [chart](#term-chart) in the [Challenge](#term-challenge) difficulty slot."}, {"term": "Option", "aka": ["Modifier", "Mod"], "concept": "Options", "definition": "A configurable aspect of gameplay. The option menu is accessible by holding the green button when selecting a [song](#term-song) or [chart](#term-chart), or by pressing \"9\" on the [cabinet](#term-cabinet)'s [e-amusement](#term-e-amusement) keypad. Here are the options available:\n\n* Speed: Multiplies the speed at which the [notes](#term-notes) (and other gameplay elements) scroll. See [Speed](#term-speed) for additional details.\n* Boost: When enabled, the scroll speed changes as notes move across the screen. Options are \"NORMAL\" (default), \"BOOST\" (notes accelerate as they approach the [receptors](#term-receptors)), and \"BRAKE\" (notes decelerate).\n* Appearance: When enabled, the notes are covered from one side of the screen. Options are \"VISIBLE\" (default), \"STEALTH\" (notes are invisible), \"HIDDEN+\" (notes are covered as they approach the receptors), and \"SUDDEN+\" (notes are covered *away from* the receptors). See [SUDDEN+](#term-sudden+) for additional details.\n* Turn: When enabled, the chart is transformed such that the notes are rotated or mirrored around the pad. (The receptors do not change order or position; the chart can still be read normally, but the notes to hit will be in different lanes.) Options are \"NORMAL\" (default), \"LEFT\" (chart is rotated counterclockwise), \"RIGHT\" (chart is rotated clockwise), \"MIRROR\" (chart is mirrored across the receptors - or, equivalently, rotated 180°), and \"SHUFFLE\" (arrow lanes are shuffled according to a randomly chosen permutation, out of 8 possible permutations).\n* Step Zone: TODO\n* Scroll: TODO\n* Arrow Color: TODO\n* Cut: When enabled, some arrows are removed from the chart based on their [quantization](#term-quantization). Options are \"OFF\" (default), \"CUT1\" TODO\n* Freeze Arrow: TODO\n* Jumps: TODO\n\nOptions persist for each player between [stages](#term-stage), and across different [sessions](#term-session) and [cabinets](#term-cabinet).\n", "help": "The most important option by far is the first one, [Speed](#term-speed), which most players change for every stage. You may also want to set your Arrow Color to NOTE to more easily read the [quantization](#term-quantization) of notes."}, {"term": "Speed", "aka": ["Rate", "X-mod"], "concept": "Options", "definition": "How fast the [notes](#term-notes) and other gameplay elements scroll across the screen. As an [option](#term-option), the player's choice of speed multiplies the baseline \"1x\" speed, where consecutive [quarter note](#term-quantization) arrows are directly adjacent to one another (no overlap and no space between the arrows).\n\nSpeed can be adjusted from the Options menu before each [stage](#term-stage). In [Premium Play](#term-premium-play), the options are 0.25x-4x in increments of 0.25, then 4.5x-8x in increments of 0.5. Without Premium Play, the options are limited to 1x-8x in increments of 0.5. Lower numbers correspond to slower scrolling; for example, selecting 0.5x will cause consecutive [quarter notes](#term-quantization) to overlap halfway, whereas selecting 2x will space consecutive quarter notes apart by an arrow's worth of space.\n\nThe speed can also be adjusted during gameplay, prior to the first [note](#term-note) of the chart, by pressing the Left or Right buttons on the [cabinet](#term-cabinet) to decrease or increase the speed, respectively. The only exception is during the [Encore Extra Stage](#term-encore-extra-stage), during which this method of changing the speed is disabled.\n", "trivia": "RemyWiki [documents](https://remywiki.com/DDR_AC_General_Info#SPEED) which DDR mix each speed option was introduced in."}, {"term": "Quantization", "aka": ["Division", "Note color"], "concept": "Rhythm", "definition": "In dance games, the quantization of a [note](#term-note) is a measure of how finely a [measure](#term-measure) of the song must be divided in order for the note's timing to coincide with one of these subdivisions. DDR and many other other dance games assign each note's color according to its quantization. Here are the relevant subdivisions and their colors when using the \"NOTE\" Arrow Color [option](#term-option):\n\n* 4th (quarter) notes: Red\n* 8th notes: Blue\n* 16th notes: Yellow\n* 32nd notes: Orange\n* 64th notes and triplets (12th, 24th, 48th…): Green\n"}, {"term": "Measure", "concept": "Rhythm", "definition": "Four [beats](#term-beat) of a [song](#term-song). When [guide lines](#term-guide-lines) TODO CHECK NAME are enabled, measures are denoted by the brigher scrolling lines."}, {"term": "Beat", "concept": "Rhythm", "definition": "The most commonly understood subdivision of a [song](#term-song) according to its tempo, which is accordingly measured in beats per minute (BPM). One beat is equivalent to a [quarter note](#term-quantization). When [guide lines](#term-guide-lines) TODO CHECK NAME are enabled, each line denotes one beat of the song."}, {"term": "Konami", "concept": "Bemani", "definition": "The company which holds the IP for [DanceDanceRevolution](#term-dancedancerevolution) and other [Bemani](#term-bemani) games."}, {"term": "Bemani", "concept": "Bemani", "definition": "[Konami](#term-konami)'s rhythm game division, which includes [DanceDanceRevolution](#term-dancedancerevolution), DANCERUSH STARDOM, beatmania IIDX, SOUND VOLTEX, jubeat, pop'n music, GITADORA, NOSTALGIA, and other inactive titles.\n"}, {"term": "DanceDanceRevolution", "aka": ["Dance Dance Revolution", "DDR"], "concept": "Bemani", "definition": "The game series that this website is all about!\n\nIndividual installments of DDR are called \"mixes\"; there have been 17 arcade DDR mixes to date, along with many home console releases. The two latest mixes (and the primary focus of this website) are [DDR A](#term-dancedancerevolution-a) (2016, pronounced \"Ace\") and [DDR A20](#term-dancedancerevolution-a20) (2019, pronounced \"Ace two-oh\").\n"}, {"term": "DanceDanceRevolution A", "aka": ["DDR A", "Ace"], "concept": "Bemani", "definition": "The 2016 installment of [DanceDanceRevolution](#term-dancedancerevolution), noteworthy for being the first mix to bring [online functionality](#term-e-amusement) (e.g. leaderboards and score tracking) to North America. The previous mix was simply called \"DanceDanceRevolution\", commonly called DDR 2014 due to its release year. The superseding (and latest) mix is [DanceDanceRevolution A20](#term-dancedancerevolution-a20).\n"}, {"term": "DanceDanceRevolution A20", "aka": ["DDR A20", "A20"], "concept": "Bemani", "definition": "The 2019 installment of [DanceDanceRevolution](#term-dancedancerevolution). TODO\n"}, {"term": "e-amusement", "aka": ["eAmuse", "EA"], "concept": "Online features", "definition": "An online service provided by [Konami](#term-konami) that enhances gameplay in a variety of ways. Players swipe an e-amusement pass near the [cabinet](#term-cabinet)'s card reader to authenticate at the start of each [session](#term-session). TODO"}, {"term": "Third Monday", "aka": ["3rd Monday", "Maintenance Monday", "e-amusement Monday", "eAmuse Monday", "Extended maintenance", "e-amusement maintenance"], "concept": "Online features", "definition": "Informal term that refers to the [e-amusement](#term-e-amusement) service's extended maintenance period, which occurs on the third *Tuesday* of every month in Japan from 2:00-7:00 AM. In the United States, this corresponds to sometime midday on the previous calendar Monday, depending on the timezone. For example, in Pacific Daylight Time the maintenance window lasts from 10:00 AM to 3:00 PM.\n\nDuring this time, DDR [cabinets](#term-cabinet) are effectively offline; [Premium Play](#term-premium-play) can't be used and play data won't be saved.\n"}, {"term": "Leaderboard", "aka": ["LB"], "concept": "Online features", "definition": "An in-game display of some of the highscores on a [chart](#term-chart). Leaderboards typically show the [world record](#term-wr), regional record, and [machine record](#term-machine-record), as well as the player's [personal record](#term-pb) and those of up to 3 of their rivals (if they have configured this feature on the [e-amusement](#term-e-amusement) website). These records are sorted by score and display the player's name and the score they obtained."}, {"term": "PB", "acronym": "Personal Best", "concept": "Online features", "aka": ["Improvement", "Personal Record", "Upscore (slang)"], "definition": "A [score](#term-score) on a [chart](#term-chart) that exceeds the player's previous highscore. The player's personal record is displayed on the [leaderboard](#term-leaderboard) on the song selection screen, as well as next to the list of charts for the selected [song](#term-song)."}, {"term": "WR", "acronym": "World Record", "concept": "Online features", "definition": "A [score](#term-score) on a [chart](#term-chart) that exceeds *all* other scores on that chart. The player and score associated with this record are displayed at the top of the [leaderboard](#term-leaderboard) on the song selection screen.", "trivia": "In DDR, tying a world record replaces the old record on the leaderboards, although players generally qualify this as a \"tied WR\" regardless of how the game treats it."}, {"term": "Machine Record", "concept": "Online features", "definition": "A [score](#term-score) on a [chart](#term-chart) that exceeds all other scores on that chart that were obtained on the same [cabinet](#term-cabinet). The player and score associated with this record are displayed near the top of the [leaderboard](#term-leaderboard) on the song selection screen."}]